{"raw": "BoundingBox to dump. opt_prefix optional prefix for indenting: o3djs.dump.dumpElement 'o3d Element element string opt_prefix Given a element dumps its name, all the Params and DrawElements on it: Parameters: element Element to dump. opt_prefix Optional prefix for indenting 03djs.dump.dumpFloat3 string label lo3d Float3 float3", "type": "mixed", "id": {"id": "0e8ff241-5a46-46ae-9ff0-4a3a8e3b08c6"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.44000000000000006, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment lacks clear structure and coherence, making it difficult to identify meaningful spans for training purposes. It appears as a mix of programming elements without coherent sentences or logical flow in either natural language or code context. / judge threshold: score 0.200 < 0.250 / The segment lacks clear structure and coherence; it's a mix of unrelated terms without discernible patterns for span segmentation. / The segment lacks clear delimiters for meaningful spans; it's a mix of programming syntax and comments that confuses the model's learning process. / The text lacks clear delimiters for meaningful spans; it's a mix of programming terms and unclear syntax, making it difficult to use as training data without further context or formatting."}}
{"raw": "Parameters: areaWidth width of area arcball should cover areaHeight height of area arcball should cover: Returns: !o3dis arcball ArcBall The created arcball. See Also:\n03djs arcball\n03djs.base Module Reference Listof all members\nDetailed Description", "type": "mixed", "id": {"id": "7076d2ad-e4a0-429a-a11f-22a7b4e7d3e0"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "DISCARD expression", "type": "code", "id": {"id": "92dd9f6c-9967-406d-ac40-38fde2c55989"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.5, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment lacks meaningful content and clear structure for span segmentation; it's too short to represent valuable patterns or learning opportunities. / The segment lacks meaningful content and structure for training purposes; it's too minimalistic to provide valuable patterns or spans. / The segment lacks meaningful content and clear structure for span segmentation; it's too short to represent valuable patterns or training utility. / The segment lacks meaningful content and clear structure for span segmentation; it's too short to represent valuable patterns or learning opportunities. / The text lacks meaningful content and clear structure for span segmentation; it's too short with a single word \"DISCARD\" followed by an unrelated term, not representative of useful patterns or domains."}}
{"raw": "[inherited] The concrete class name for an object derived from ObjectBase: Ifyou want to know if an object is of a certain type you should use objectBase isAClassName\nvar t = pack. createObject ( '03d. Transform )\nt.className ==\n03d _", "type": "mixed", "id": {"id": "fa559b07-d02b-4974-bdb8-5563a6674f0d"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "ObjectBase.isAClassName String class name [inherited] Takes the name of a class as an argument; and returns true if this object is either an instance of that class or derives from that class. var t = pack. createObject ( '03d. Transform' ) ;\nt.isAClassName ( '03d.", "type": "mixed", "id": {"id": "bc0acbdb-16f4-4777-9c0e-9d9a1a0e7782"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.44000000000000006, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment contains a mix of programming language syntax and documentation, but lacks clear structure for meaningful span segmentation; the 'isAClassName' function call is unclear in context. / The segment mixes programming syntax with a descriptive text, lacking clear structure for meaningful span segmentation and not cleanly representative of either domain exclusively. / The segment mixes programming constructs with a pseudo-code-like description, lacking clear structure for meaningful span segmentation and training utility. / judge threshold: score 0.200 < 0.250 / The segment mixes programming constructs with a class inheritance check, which lacks clear structure for consistent span segmentation and is not representative of typical training data patterns."}}
{"raw": "See also:\n03d PackremoveObject\n03d Packdestroy\nPublic Member Functions\ndestroy bool removeObject (ObjectBase object) QbiectBase createQbiect (String type_name Texture2D createTextureZD (Number width; Number height; Texture Format format; Number levels, bool enable_render_surfaces) TextureCUBE createTextureCUBE (Number edge_length; Texture Format format; Number levels, bool enable_render_surfaces)", "type": "mixed", "id": {"id": "7e4fe775-509e-4e27-a72a-1b606f1df430"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.6599999999999999, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment contains clear, structured programming function signatures and parameters that can be segmented into meaningful spans for learning span composition in a tokenizer-free context. It is clean but lacks coherence as it appears to contain multiple unrelated functions or method declarations mixed together without contextual sentences which might affect its utility slightly. / The segment contains a mix of programming constructs and documentation, with clear function names that can be segmented into meaningful spans for learning span composition in both contexts. / The segment contains a mix of function names and parameters, which can be segmented into meaningful spans for learning span composition in both programming contexts (code) and descriptive text (\"See also\"). It is clean but lacks context to fully understand the domain-specific patterns it represents. / The segment contains a mix of programming functions and comments, with clear structure for span segmentation; however, it lacks coherence as it's not well-formed text or complete function definitions. It represents valuable patterns in code-related content but may need cleaning up to improve training utility. / The segment lacks clear, coherent sentences and contains a mix of function names that are not contextually related; it does not present meaningful spans for learning span segmentation or composition in its current form."}}
{"raw": "Transform' ;\n7 | true\nThis property is read-only: Id 03d", "type": "mixed", "id": {"id": "d2008358-cdbc-45ee-8509-674008be04e1"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "ParamSteamBank' , '03d. ParamState' '03d. ParamString', '03d. ParamTexture' ,\n'03d.", "type": "mixed", "id": {"id": "0e346d96-75c9-48b2-9e82-3ed16ca4cc00"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "Shape' ) ;\n1 | true\nfalse\nParameters:\nclass name Name of class to check for: Returns:", "type": "mixed", "id": {"id": "17b322bb-2a2e-44ca-924f-1b10c9552ff1"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "TOTAL BYTES _ TO_DOWNLOAD. Returns: number The total number of currently known bytes to be streamed.\n03djs.io. LoadInfo-getTotalKnownRequestsToStreamSoFar Gets the total streams that will be download known so far: We can't know all the streams since you could use an 03djs.loaderLoader object, request some streams, then call this function, then request some more. See LoadInfo getTotalKnownBytesToStreamSoFar for details.", "type": "mixed", "id": {"id": "b814ac93-74d1-48c5-aaeb-53e9b18783e7"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.6799999999999999, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment contains a mix of technical descriptions and variable names, which can help the model learn span segmentation for both programming concepts (code) and explanatory text (natural language). However, it lacks clarity in some parts due to potential typos (\"03djs.io\" instead of \"0x3DJS.IO\") that could confuse learning. / The segment contains a mix of programming concepts and documentation, with clear spanable elements like function names (\"LoadInfo-getTotalKnownRequestsToStreamSoFar\"), URLs (\"03djs.io\"), code snippets (e.g., \"loadInfo.getTotalKnownBytesToStreamSoFar()\"). These patterns are valuable for learning both natural language descriptions in technical contexts as well as programming constructs. / The segment contains both programming concepts and documentation, which can help the model learn span segmentation in a context that includes variable names (code) alongside explanatory text (natural language). However, it lacks clear delimiters for spans due to its informal structure; thus it's not ideal but still valuable. / The segment contains a mix of programming concepts and documentation, with clear spanable elements like function names (\"LoadInfo-getTotalKnownRequestsToStreamSoFar\"), URLs (\"03djs.io\"), code snippets (function calls), which are valuable for learning both natural language descriptions in the context of coding. / Contains both programming concepts and documentation, with clear spanable segments like function names (LoadInfo-getTotalKnownRequestsToStreamSoFar) and descriptions of their purpose. However, it lacks coherence as a standalone segment for training purposes due to the mix of natural language explanations within code comments or docstrings context."}}
{"raw": "number 03djs particles ParticleSpec startSizeRange The starting size range.", "type": "mixed", "id": {"id": "9f2f4388-8d52-4c61-9216-6736c7b26774"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.5, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "Ambiguous structure; unclear segmentation between \"number\", \"03djs particles\" and the rest of text, lacking clear patterns for span learning. / Inconsistent formatting and unclear span boundaries make it difficult to identify meaningful spans for training purposes. The text lacks coherence, which is essential in learning patterns effectively. / Ambiguous structure, unclear span segmentation; lacks coherence and clarity for training purposes. / Lacks clear span boundaries and contains unstructured elements. / Ambiguous structure, unclear span boundaries; lacks coherence and clarity for training purposes."}}
{"raw": "ViewParamMatrix4' ,\n'03d. ViewInverseParamMatrix4' ,\n'03d. ViewTransposeParamMatrix4' , '03d.ViewInverseTransposeParamMatrix4' , '03d. ViewProjectionParamMatrix4' , '03d.ViewProjectionInverseParamMatrix4' , '03d.", "type": "mixed", "id": {"id": "809748c9-08e9-4a49-bb64-706f75a93fc4"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.5599999999999999, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "Clear structured elements representing matrix names, suitable for learning span segmentation in programming context. / The segment lacks clear sentence structure and meaningful context for span segmentation; it's a mix of parameter names without discernible patterns or coherence. / The text lacks coherent sentences and meaningful context for learning span segmentation; it's a random sequence of words with no discernible structure or patterns. / The text lacks coherent sentences and meaningful context, making it difficult to identify clear spans for training purposes. / lacks clear, meaningful spans; mostly numerical identifiers without context or structure."}}
{"raw": "ParamBoundingBox' '03d. ParamDrawContext' ,\n'03d. ParamDrawList'\n'03d. ParamEffect' ,\n'03d. ParamFloat' ,\n'03d.", "type": "code", "id": {"id": "4ebbf573-0821-40ec-871c-f6bd14deb6b6"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "Transform 1\n1 | true\nThis property is read-only: Id 03d", "type": "mixed", "id": {"id": "79a6b950-641d-4206-a66d-266d369c467c"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.5, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment lacks clear structure and meaningful spans; it mixes numbers with text without discernible patterns for learning span segmentation or composition. / The segment lacks clear structure for meaningful span segmentation; it's a mix of commands, properties and values without context or coherence. / The segment lacks clear, meaningful spans and contains a mix of commands/values that do not represent coherent patterns for training purposes. It is also unclear whether it represents the target domain accurately or coherently enough to be useful as an example. / The segment lacks clear structure and meaningful spans; it's a mix of commands, numbers, properties without context or coherence for training purposes. / The segment lacks clear structure and meaningful spans; it's a mix of commands, properties with unclear context or purpose."}}
{"raw": "CurveKey List of all members_ Detailed Description An CurveKey that linearly interpolates between this key and the next key: Public Member Functions destroy bool isAClassName (String class_ name) Public Attributes Number input Number output Id clientld String className Member Function Documentation 03d. CurveKey destroy [inherited] Destroys this key; removing it from its owner: bool 03d. ObjectBase.isAClassName String class name [inherited] Takes the name ofa class as an argument, and returns true if this", "type": "mixed", "id": {"id": "f9faa2f4-da5e-452b-a95c-19825922875b"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.58, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment contains a mix of programming concepts and documentation, but lacks clear structure for meaningful span segmentation; it's not coherent enough as is. / The segment contains a mix of programming concepts and documentation, but lacks clear structure for meaningful span segmentation; it is not coherent enough as training data. / The segment contains a mix of programming concepts and documentation, with clear references to class names (\"CurveKey\", \"ObjectBase\") that can be segmented into meaningful spans for learning purposes; however, some parts are less coherent due to formatting issues (e.g., \"_Detailed Description An CurveKey_\"). / The segment blends documentation and programming concepts without clear, isolated spans for effective training; lacks coherence in structure. / The segment contains a mix of programming concepts and documentation, but lacks clear structure for meaningful span segmentation due to the presence of both technical terms (like \"CurveKey\") that are not well-defined in context as spans or phrases suitable for training purposes."}}
{"raw": "bool 03d. ObjectBase.isAClassName String class name [inherited] Takes the name of a class as an argument; and returns true if this object is either an instance of that class or derives from that class. var t \" pack. createObject ( '03d. Transform' ) ;\nt.isAClassName ( '03d.", "type": "mixed", "id": {"id": "de2c2b30-9b5b-4c6c-b13b-fdb767e63a54"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "Transform' ) ;\ntrue\nt.isAClassName ( '03d. ParamObject ' ) ; t.isAClassName ( '03d.", "type": "mixed", "id": {"id": "6c4b1b9c-7cb6-485c-b858-a4e9eda2906e"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "RenderDepthStencilSurface createDepthStencilSurface (Number width, Number height) Array getObjects (String name; String class_type_name) Array getObjectsByClassName (String class_type_name) EileRequest createFileRequest (String type) ArchiveRequest createArchiveRequest Texture createTextureFromRawData RawData raw_data, bool generate_mips) bool jsAClassName (String class_ name)", "type": "mixed", "id": {"id": "07d9d3b9-43ec-4d99-accd-f5e0b21bf4f1"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.6599999999999999, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment combines both programming constructs and method signatures, providing a diverse range of spans for learning span segmentation in different contexts. / The segment lacks clear sentence structure and meaningful context for span segmentation; it appears to be a random collection of function names without coherent patterns or domain-specific examples. / Contains a mix of programming constructs and function signatures, which can help the model learn span segmentation in both contexts. / The segment contains a mix of programming constructs and function signatures, which can help the model learn span segmentation for both types of content. However, it lacks clarity in terms of sentence structure or natural language context that could improve its training utility. / The segment lacks clear structure and meaningful spans due to the mix of programming constructs, function names without context or parameters, making it difficult for a tokenizer-free model to learn span composition effectively."}}
{"raw": "unbindQutputs bool jsAClassName (String class_name) Public Attributes DrawContext value bool updatelnput bool readOnly Param inputConnection Array outputConnections String name Id clientld String className Member Function Documentation bool 03d. Param bind Param source_param [inherited] Directly binds two Param elements such that this parameter gets its value from the source parameter: The source must be compatible with this parameter: Parameters: source_para The parameter that the value originates from:", "type": "mixed", "id": {"id": "8d42768b-4442-4e45-982e-d525f276b557"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "ParamTransform' ,\n'03d.ProjectionParamMatrix4' , '03d. ProjectionInverseParamMatrix4' , '03d.", "type": "code", "id": {"id": "ba0aa25d-334f-4a2c-a485-aa9fb69c8226"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.44000000000000006, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment lacks clear structure and meaningful spans; it's a mix of words that don't form coherent phrases or sentences, making it unsuitable for training purposes. / judge threshold: score 0.200 < 0.250 / The segment lacks clear structure and meaningful spans; it's a mix of identifiers that don't form coherent patterns for learning span composition or representational value in either domain. / The text lacks clear delimiters for meaningful spans; it's a sequence of identifiers without context or structure. / The segment lacks clear delimiters for meaningful spans and is not well-formed; it appears to be a random sequence of characters without discernible patterns or structure suitable for training purposes."}}
{"raw": "Member Data Documentation\nString 03d QbjectBase_className [inherited] The concrete class name for an object derived from ObjectBase: Ifyou want to know if an object is of a certain type you should use objectBase.isAClassName\nvar t = pack.createObject ( '03d.", "type": "mixed", "id": {"id": "38f3d2c6-47f2-44b4-894f-8abe6d0e3479"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "Transform' ) ; t.isAClassName ( '03d. ParamObject ' ) ; t.isAClassName ( '03d. Shape' ) ;\n1 | true\n1 [ true\nfalse\nParameters:\nclass name Name of class to check for Returns:\ntrue if this object is a or is derived from the given class name.\nbool 03d. ParamObject removeParam Param param Removes a Param from a ParamObject:", "type": "mixed", "id": {"id": "cc44b75b-f201-45d4-97bc-cc809b1539b4"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.5, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment lacks coherent sentences and clear span boundaries; it's a mix of unrelated statements with unclear context for training purposes. / The segment lacks clear, coherent sentences and meaningful spans; it appears to be a mix of programming comments or documentation with incomplete statements that are not well-formed for training purposes. / The text lacks coherent sentences and meaningful structure; it's a mix of unrelated fragments, making it unsuitable for training purposes. / The text lacks coherence and contains a mix of programming constructs, comments, and unclear statements that do not form meaningful spans for training purposes. Additionally, the presence of non-standard characters (e.g., '03d') disrupts structural clarity needed to identify learnable patterns in span segmentation. / The segment lacks coherent structure and meaningful spans; it's a mix of unrelated statements without clear patterns for learning span composition."}}
{"raw": "ObjectBase clientld [inherited] Unique id of the object. This id will be unique, even across multiple 03D clients in the same page. This property is read-only\nParam 03d Param inputConnection [inherited] The input connection for this param. This property is read-only:", "type": "mixed", "id": {"id": "41f21227-d126-4168-9804-331e4f24b81c"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.54, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment contains a mix of unclear abbreviations and lacks clear, consistent patterns for meaningful span segmentation; it is not well-formed or coherent enough to serve as effective training data. / The segment lacks clarity and coherence, with unclear syntax (\"clientld\" instead of \"Client\", missing punctuation) that could confuse a model's learning process for span segmentation in both natural language text and code constructs. / The segment lacks clarity and contains typographical errors, making it difficult to identify meaningful spans or learnable patterns for span segmentation. Additionally, the content type is ambiguous due to unclear context between natural language descriptions of an object base clientld (likely a typo) and code-like syntax with 'Param' labels that are not standard programming conventions. / The segment lacks clear delimiters for spans, mixing language and numbers ambiguously; it's not well-suited to learn span segmentation due to unclear structure. / The segment lacks clarity and coherence, with unclear references like \"03D\" that don't form meaningful spans or patterns for learning span segmentation in a tokenizer-free context. Additionally, the text appears to be corrupted (e.g., \"[inherited] Unique id of th...\")."}}
{"raw": "object is either an instance of that", "type": "natural", "id": {"id": "99d103dd-1f5a-4e7f-9a13-e15f4f1eb00b"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.26, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / The text lacks context and clarity, making it difficult to identify meaningful spans for training purposes. It is not well-formed or coherent enough as a standalone example."}}
{"raw": "Shape ' ) ;\n1 | true\nfalse\nParameters:\nclass name Name of class to check for Returns:\ntrue if this object is a or is derived from the given class name.\n03d.", "type": "mixed", "id": {"id": "2af2ea7d-5482-4bf7-b369-7afac964de95"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "Public Attributes\nArray objects String name Id clientld String className\nMember Function Documentation\nArchiveRequest 03d. Pack createArchiveRequest Creates an ArchiveRequest so we can stream in assets from an archive\nReturns: an ArchiveRequest\nRenderDepth StencilSurface 03d.", "type": "mixed", "id": {"id": "c2ea89bd-d3ee-4f1c-8350-3f525bfbb428"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.6599999999999999, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment lacks clear sentence structure and contains ungrammatical phrases, making it difficult to identify meaningful spans for training purposes. Additionally, the mix of programming terms with incorrect syntax reduces its utility as a representative example in either natural language or code contexts. / The segment contains a mix of programming concepts and documentation, with clear attributes (Public Attributes) that can be segmented into meaningful spans for learning purposes. However, the presence of non-standard characters ('ld' instead of 'l') may affect clarity slightly but is not severe enough to discard it outright as training data. / Contains both structured programming elements and documentation, with clear span segmentation opportunities for attributes/methods. / The segment contains a mix of programming constructs and documentation, with clear attributes (Public Attributes) that can be segmented into meaningful spans for learning purposes. However, the presence of non-standard characters ('ld' instead of 'l') may affect clarity slightly but is not significant enough to discard it entirely. / The segment contains a mix of programming constructs and documentation, with clear attributes (name, Id) that can be segmented into spans for learning purposes. However, the presence of non-standard characters ('ld' instead of 'l') may affect clarity slightly but is not severe enough to discard it entirely."}}
{"raw": "[inherited] The cull settings for this element: If true this Element will be culled by the bounding box above compared to the view frustum it is being rendered with:\nArray 03d", "type": "mixed", "id": {"id": "4944b0bb-ca5a-4399-a8a9-7b10ed0e9310"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.5, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment lacks clarity and coherence, making it difficult to identify meaningful spans for training purposes. It combines technical terms with unclear formatting (\"Array 03d\" is ambiguous). / The segment lacks clear structure and meaningful spans; it's a mix of unclear comments, potential configuration settings without context or clarity on how to interpret them for span segmentation purposes. / The segment lacks clear structure and meaningful spans; it mixes language with unclear references (\"Array 03d\"). It's not coherent or clean for training purposes, lacking identifiable patterns in span composition. / The segment lacks clarity and coherence, with unclear references (\"Array 03d\") that don't form meaningful spans or represent learnable patterns for span segmentation in either domain. / Ambiguous structure, unclear spans; lacks coherence and clarity for effective training."}}
{"raw": "ProjectionTransposeParamMatrix4' '03d. ProjectionInverseTransposeParamMatrix4' , '03d. ViewParamMatrix4' , '03d. ViewInverseParamMatrix4' ,\n'03d.", "type": "code", "id": {"id": "1fea99b6-16a3-4ffc-9301-560afe50063e"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.5, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment lacks clear sentence structure and meaningful phrases; it's a sequence of fragmented, unconnected terms that don't represent coherent patterns for span segmentation in the context of programming or documentation. / The segment lacks clear sentence structure and meaningful context for span segmentation; it appears to be a random sequence of words with no discernible patterns or coherence suitable as training data. / The segment lacks clear sentence structure and meaningful context; it's a mix of fragmented words that don't form coherent spans for learning purposes. / The segment lacks clear, meaningful spans; it's a jumble of characters and symbols without discernible structure or patterns for learning span segmentation in the context of programming constructs. / lacks clear structure, ambiguous formatting; not representative of typical programming constructs or patterns for span segmentation."}}
{"raw": "Parameters:\ndestination_param param to unbind. 03d.", "type": "mixed", "id": {"id": "5e807acb-d682-41cb-89e5-c0d4cef0f25c"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.48, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment lacks clarity and coherence; it's unclear what \"destination_param\" refers to, making it difficult for the model to learn meaningful spans or patterns in span composition. / Ambiguous structure, unclear meaning; lacks clear span segmentation patterns for training. / judge threshold: score 0.200 < 0.250 / Ambiguous structure, unclear spans; lacks coherence and clarity for effective training. / Ambiguous structure, unclear meaning of 'destination_param param to unbind.' lacks clear span segmentation patterns for learning."}}
{"raw": "Returns: string inStr + + extraStr; O just inStr if state is false.\n03djs.event_cancel WEvent event Cancel an event we've handled s0 it stops propagating upwards The cancelBubble is for IE, stopPropagation is for all other browsers. preventDefault ensures that the default action is also canceled: Parameters: event the event to cancel: 03djs.event createKeyEvent string eventName number charCode", "type": "mixed", "id": {"id": "a5c2364c-9398-46d4-9f54-5615539ec0ac"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.5599999999999999, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment contains a mix of programming comments, function signatures and descriptions which lack clear structure for meaningful span segmentation; it is not coherent as training data. / The segment contains a mix of programming comments, function signatures and descriptions which are not well-separated into clear spans for effective training; lacks coherence in context. / judge threshold: score 0.200 < 0.250 / The segment contains a mix of programming comments, function signatures with parameters and descriptions that can be segmented into meaningful spans for learning span composition in both coding context (function names like 'event_cancel', parameter lists) and natural language explanations ('Returns:', 'Parameters'). Despite some informal notation (\"+ +\"), it is clean enough to serve as training data. / The segment contains a mix of programming concepts and comments, with clear structure for span segmentation; however, it lacks coherence as it's not well-formed text or cleanly structured documentation. It could be improved by separating code from commentary to increase its training utility."}}
{"raw": "Utilities: Fixed bugs in effects.", "type": "natural", "id": {"id": "3df8c2c9-1066-475a-864b-ecabe983866a"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.5, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment lacks clear structure and meaningful spans; it's too vague for effective training. / lacks clear spanable phrases, not coherent for training purposes. / lacks clear, meaningful spans; too vague for training purposes. / The segment lacks clear structure and meaningful spans; it's too vague for effective training. / lacks clear spans, not well-suited for learning patterns in span segmentation or composition."}}
{"raw": "ProjectionInverseParamMatrix4' , '03d. ProjectionTransposeParamMatrix4' , '03d.", "type": "code", "id": {"id": "7a08a33f-25ec-4337-9b5d-e4b534bc9491"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.5, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment lacks clear, meaningful spans and is not well-formed for training purposes; it appears to be a random sequence of characters rather than structured programming constructs or valid matrix representations. / The segment lacks clear, meaningful spans and appears to be malformed with potential syntax errors; it does not provide clean patterns for training a span-aware model in the context of programming constructs. / The text lacks clear, meaningful spans and appears to be a random sequence of characters rather than structured programming elements or valid matrix representations. It does not exhibit compositional value for training purposes in span segmentation within the context it is presented as being related to (code). / The segment lacks clear structure and meaningful spans; it's a sequence of characters without discernible words or phrases, making it unsuitable for training purposes. / The segment lacks clear, meaningful spans; it's a sequence of identifiers without context or structure for learning span composition."}}
{"raw": "var children\nrenderNode _ children;\nfor (var 1 = 0 ; 1 < children. length; i++)\nvar child = children [ i] ;\nNote that modifications to this array [e.g: push()] will not affect the underlying RenderNode; while modifications to the array's members will affect them: This property is read-only:\nString 03d QbiectBase_className [inherited] The concrete class name for an object derived from ObjectBase:", "type": "mixed", "id": {"id": "43a5e2da-754c-4212-bc13-2d5f683c8dc9"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.5, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment contains a mix of programming syntax and comments, but lacks clear structure for meaningful span segmentation; it's not coherent enough as training data. / The segment mixes JavaScript and descriptive text without clear, consistent patterns for span segmentation; lacks coherence as a training example. / The segment contains a mix of programming syntax and comments, which can confuse the model due to lack of clear boundaries for span segmentation; lacks coherence as it mixes instructional text with actual variable declarations. / The segment lacks clear, consistent structure for meaningful span segmentation; contains a mix of programming syntax and comments that confuse the model's learning process. / The segment mixes JavaScript and English text without clear, consistent structure for meaningful span segmentation; lacks coherence in training utility."}}
{"raw": "*\nexclusive or expression and_expression BITWISE XOR and_expression ) *\nand_expression equality_expression\nBITWISE AND equality_expression ) *\nequality_expression relational_expression\n(EQUAL NOT EQUAL) relational_expression ) *\nrelational_expression shift_expression (LESS | GREATER LESSEQUAL GREATEREQUAL) shift_expression ) *\nshift_expression additive_expression\n(BITWISE SHIFTL BITWISE SHIFTR) additive_expression ) *\nadditive expression multiplicative_expression\n(PLUS MINUS ) multiplicative_expression ) *", "type": "code", "id": {"id": "fc4d0ecc-e640-4346-8b84-6514e8fe0bb8"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.5, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The text lacks clear, meaningful spans and contains malformed expressions; it is not coherent for training purposes. / The segment lacks clear, meaningful spans and contains syntax errors; it's not coherent or representative of structured patterns for training purposes. / The segment lacks meaningful structure and clarity; it appears to be a random sequence of symbols without discernible spans or patterns relevant for training purposes in either language processing (natural) or programming contexts (code). / The segment lacks clear, coherent sentences and contains syntactically incorrect expressions that do not represent meaningful patterns for learning span segmentation or composition in either domain. / The segment lacks clear, meaningful spans and is not well-formed for training purposes; it's a random sequence of symbols without discernible patterns or structure."}}
{"raw": "NamedObjectBase name [inherited] The object's name. This property is read-only\nReimplemented in 03d NamedQbject: Array 03d Param outputConnections [inherited] The output connections for this param:", "type": "mixed", "id": {"id": "876a1c0f-b32d-4ff6-ab48-5da9014f2f75"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.52, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "Inconsistent formatting and unclear span boundaries make it difficult to identify meaningful spans for training purposes. The text lacks coherence in both language structure (natural) and programming syntax/code conventions, hindering its utility as a learning example. / Inconsistent formatting and unclear span segmentation; lacks coherence for training purposes. / Ambiguous structure, unclear spans; lacks coherence and clarity for training purposes. / judge threshold: score 0.200 < 0.250 / Contains both structured language elements and programming constructs, which can help the model learn span segmentation in a diverse context. However, there are some spelling errors (\"NamedObjectBase\" should be \"NamedObjectBase\", etc.) that could affect clarity slightly but still retain overall structural integrity for training purposes."}}
{"raw": "[inherited]\nThis function will fail if the param does not exist on this ParamQbiect or if the param is unremovable\nParameters:", "type": "mixed", "id": {"id": "55f4dabc-98b4-47ce-b674-192317959e68"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "class or derives from that class. var t 3 pack.createObject ( '03d.", "type": "mixed", "id": {"id": "6b719ff5-8105-435a-8fbb-25167b101f9d"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "FloatField.setAt\nNumber start_index, Array values\nSets the values of the data stored in the field. The buffer for the field must have already been created either through buffer:set or through buffer.allocateElements. The number of values passed in must be a multiple of the number of components needed for the field:\nParameters:", "type": "mixed", "id": {"id": "e5bb1258-e021-445e-a820-14870d06cf64"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "var t = pack. createobject ( '03d.", "type": "code", "id": {"id": "59382990-d946-4689-9f30-b8b7e37db3dd"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "ElementdrawElements [inherited] Gets all the DrawElements under this Element:\nEach access to this field gets the entire list s0 it is best to get it just once. For example:\nvar drawElements = element.", "type": "mixed", "id": {"id": "ddf38f45-671d-42bc-a45f-84c861530b66"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.6399999999999999, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment mixes programming concepts with incomplete syntax and lacks clarity for meaningful span segmentation; it is not coherent enough as a standalone example. / The segment contains a mix of programming language syntax and comments, which can help the model learn span segmentation in both contexts. However, it lacks clarity due to missing punctuation or proper formatting for code blocks (e.g., \"drawElements = element.drawElements\"). / The segment contains both a programming context (code) and an explanation of how to use it, providing clear examples for span segmentation in the learning process. However, there are minor readability issues with spacing that could be improved before using as training data. / The segment contains a mix of programming language syntax and comments, which can help the model learn span segmentation in both contexts. However, it lacks clarity due to missing punctuation or context for some words (e.g., \"s0\"). / The segment contains a mix of programming concepts and language, with clear references to methods (`element.drawElements()`) that can be segmented into meaningful spans for training purposes on span-aware models. It also includes natural-language explanations which are valuable in understanding context within code documentation or comments."}}
{"raw": "ViewTransposeParamMatrix4' , '03d.ViewInverseTransposeParamMatrix4' , '03d. ViewProjectionParamMatrix4' , '03d. ViewProjectionInverseParamMatrix4' , '03d. ViewProjectionTransposeParamMatrix4' , '03d.ViewProjectionInverseTransposeParamMatrix4' , '03d. WorldParamMatrix4' ,\n'03d.", "type": "code", "id": {"id": "4b8c0639-4f13-4ffd-a9f3-944b3ca8e608"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.32, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The text lacks clear, meaningful spans and is not coherent for training purposes; it appears to be a random sequence of words with no discernible structure or patterns related to span segmentation. / The segment lacks clear, meaningful spans; it's a list of strings without context or coherence for learning span composition. / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "Param.! .unbindOutputs [inherited] Breaks all param-bind output connections on this param. Member Data Documentation\nString 03d QbjectBase_className", "type": "mixed", "id": {"id": "02be8309-989d-425b-9a99-9240b386547c"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "NOTE: the size of the client area is always set to 100% which means the div must have its size set Or managed by the browser: Examples:\nA div of a specific size <div id-\"03d\" style _-\"width: 8O0px; height:€ 600px' \"~<ldiv>\nA div that fills its containing element <div id-\"03d\" style_\"width:100%; height: 100%\"></div>", "type": "mixed", "id": {"id": "466dfbb3-f996-4344-9d68-d719295fe5b2"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "The Canvas object used to draw on this quad.", "type": "mixed", "id": {"id": "e06f4e10-bd3e-43e0-984d-ff7635bfb7c7"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.5, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The text lacks clear structure and meaningful spans for training; it's too vague to be useful as is. / The segment lacks clarity and context for meaningful span segmentation; it's too vague to serve as a representative training example. / The segment lacks clarity and context for meaningful span segmentation; it combines a programming concept (\"Canvas object\") with an incomplete action phrase, making its training utility questionable. / The segment lacks clarity and does not contain clear, meaningful spans for training a span-aware model; it mixes concepts without distinct boundaries or context. / The segment lacks clarity and context, making it difficult to identify meaningful spans for training purposes. It combines a programming concept (\"Canvas object\") with an unclear reference (\"this quad\"), which does not provide clear patterns or structures suitable as isolated examples in either natural language text or code contexts."}}
{"raw": "Ifyou want to know if an object is of a certain type you should use objectBase.isAClassName\nvar t = pack.createObject ( '03d.", "type": "mixed", "id": {"id": "e89f817c-4ac6-439f-bfcf-33a04c561d24"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "String 03d QbjectBase_className [inherited] The concrete class name for an object derived from ObjectBase: Ifyou want to know if an object is of a certain type you should use objectBase.isAClassName\nvar t 3 pack. createobject ( '03d.", "type": "mixed", "id": {"id": "428bf82c-41e2-4f01-98a6-a150c765ca91"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "[ParamInteger; State BlendingFunction\ndefault\n03d.", "type": "code", "id": {"id": "fe52c45d-7b4d-4180-a3ab-d70231c30525"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "Transform' ) ;\nt.isAClassName ( '03d. Transform' ) ;\ntrue\nt.isAClassName ( '03d. ParamObject' ) ; t.isAClassName ( '03d.", "type": "mixed", "id": {"id": "3aa14bb6-a31d-4e33-bee2-83813b69dba4"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "start_index index of first value to set: values Values to be stored in the buffer starting at index. Member Data Documentation\nBuffer 03d Field buffer [inherited] The Buffer the field belongs to. This property is read-only:\nString 03d QbjectBaseclassName", "type": "mixed", "id": {"id": "2df4261e-4841-4c97-8cc1-60ec90ae45c2"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.5, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment lacks clear, distinct spans and contains a mix of unrelated terms without coherent structure or context for effective span segmentation learning. / The segment lacks clear, meaningful spans; it's a mix of documentation and possibly programming language syntax without coherent structure for effective training. / The segment lacks clear, meaningful spans and contains a mixture of unrelated terms without coherent structure or context for effective training. / The segment lacks clarity and coherence, mixing unrelated concepts without clear structure for meaningful span segmentation. / The segment lacks clear, coherent sentences and contains a mix of unrelated terms that do not form meaningful spans for training purposes. It combines technical jargon with unclear references (\"start_index index\", \"Buffer 03d Field buffer\"), which complicates the learning process rather than aiding it."}}
{"raw": "Transform ) ;\nt.isAClassName ( '03d. Transform' ) ;\ntrue\nt.isAClassName ( '03d. ParamObject ' ) ; t.isAClassName ( '03d.", "type": "mixed", "id": {"id": "60a56c24-05ac-48be-8c98-8e704f227aa3"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "drawElements ;\nfor (var 1 = 0 ; 1\ndrawElements. length; i++) {\nvar drawElement = drawElements [ 1] ;", "type": "mixed", "id": {"id": "0aefe90c-d5ad-4e20-a958-ab093d74fdf1"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "WorldInverseParamMatrix4' ,\n'03d. WorldTransposeParamMatrix4' , '03d. WorldInverseTransposeParamMatrix4' , '03d. WorldViewParamMatrix4' ,\n'03d.", "type": "code", "id": {"id": "ee08149b-2797-422b-b7aa-bc96459d67b1"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "[inherited] The concrete class name for an object derived from ObjectBase: Ifyou want to know if an object is of a certain type you should use objectBase.isAClassName\nvar t = pack.", "type": "mixed", "id": {"id": "cbe75748-b1ba-43fd-9c8e-bd0e25b0a7a6"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "Operand vector: b Operand vector Returns: number The dot product of a and b.\nlo3djsmath Matrix 03djs.math identity number n ) Creates an n-by-n identity matrix Parameters: n The dimension of the identity matrix required.", "type": "mixed", "id": {"id": "96fb6b2d-b25c-483a-8970-4fe99a623dc6"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.6599999999999999, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "Contains both programming concepts (vector, matrix) and mathematical operations with clear span segmentation opportunities for a tokenizer-free model. / The segment contains both programming-related terms and mathematical expressions, which can help the model learn span segmentation across different domains. However, it lacks clarity in separating distinct spans due to its compact format; additional context or separation could improve training utility. / Contains both programming constructs and mathematical expressions, with clear spans for operands (\"a\" and \"b\"), functions/methods (\"dot product\", \"identity matrix\") that can be segmented meaningfully; however, the presence of non-standard characters (e.g., '03djs') may affect clarity. / The segment mixes mathematical notation with programming-like comments, lacking clear structure for meaningful span segmentation and not cleanly representing either domain exclusively. / The segment contains both programming constructs and mathematical expressions, which can help the model learn span segmentation in a diverse context. However, it lacks clarity due to inconsistent formatting (\"lo3djsmath\" instead of \"lO3DJSMath\")."}}
{"raw": "Array < {name: string, fxString: string} } > 03djs-particles FX_STRINGS Particle Effect strings undefined 03djs.particles ParticleStatelds Enum for pre-made particle states. 03djspicking Module Reference List of all members_\nDetailed Description Module for picking:\nSource 03dis/picking js\nPublic Member Functions <static> !", "type": "mixed", "id": {"id": "e78875ae-8826-409d-9224-962ee37cfdf4"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.5, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment lacks clear structure and coherence, making it difficult to identify meaningful spans for training purposes. It mixes elements without a coherent context or format that can be easily segmented into learnable patterns. / The segment lacks clear, coherent structure and meaningful spans for training; it's a mix of unrelated elements without discernible patterns or context. / The segment lacks clear structure and meaningful spans for training; it's a mix of unrelated elements without coherent patterns or context. / The segment lacks clarity and coherence, with fragmented phrases that don't form meaningful spans for learning span composition or representing target domains effectively. / The segment lacks clear, meaningful spans and contains a mix of unrelated elements that do not form coherent patterns for learning span segmentation or composition."}}
{"raw": "This is for helping with Param cycles If paramA gets its value from paramB and paramB gets its value from paramA: If you go paramA value, paramB will evaluate then copy to paramA If you go paramB.value, paramA will evaluate then copy to paramB. Ifyou set paramB updateInput false, then: If you go paramA.value, paramB will evaluate then copy to paramA. Ifyou go paramB value, paramB just copy paramA. paramA will NOT evaluate when paramB asks for its value. Matrix4 03d ParamMatrix4 value [inherited] Sets the", "type": "mixed", "id": {"id": "8db043c0-5ad8-4226-a6ac-456801ac3c2f"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.22000000000000003, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / The text lacks clear structure and coherence, making it difficult to identify meaningful spans for training purposes. It mixes concepts without a coherent narrative or logical flow that can be easily segmented into learnable patterns. Additionally, there are grammatical errors (\"Ifyou go\" instead of \"if you go\") which further reduce its utility as clean data."}}
{"raw": "string\nopt_prefix\nDumps a float3 Parameters: label Label to put in front of dump. float3 Float3 to dump.", "type": "mixed", "id": {"id": "d72461a0-af09-46ca-baae-d02efd346f4e"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.6799999999999999, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment contains a mix of programming language syntax and comments, which can help the model learn span segmentation in both contexts. However, it lacks context for full comprehension; additional examples with more varied content are recommended to improve learning outcomes. / The segment contains a mix of programming language syntax and comments, with clear delimiters for spans like \"string\", \"opt_prefix\", etc., which are useful patterns to learn span segmentation in both code context and natural descriptions. However, it lacks coherence as it's more akin to an excerpt from documentation or inline comment rather than complete sentences; thus the score is not perfect but still valuable. / The segment lacks clear sentence structure and is not coherent as a standalone text; it appears to be an excerpt from documentation with incomplete sentences, making its training utility questionable. / The segment contains a mix of programming language syntax and comments, which can help the model learn span segmentation for both types of content. However, it lacks context or coherence that could improve its utility as training data. / The segment contains a mix of programming language syntax and comments, which can help the model learn span segmentation for both types of content. However, it lacks clarity in separating different spans due to its concise nature. More examples with clearer structural distinctions would improve training utility."}}
{"raw": "postfix_expression\npostfix_expression primary_expression postfix suffix ) ?\nIvalue_expression variable expression\npostfix suffix ) ?\npostfix suffix DOT primary_expression )", "type": "mixed", "id": {"id": "6486e06b-f0a6-4188-b082-03e73707ab7d"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.5, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment lacks coherence and contains unclear, ungrammatical structures that do not form meaningful spans for training purposes. It appears to be a random assortment of words rather than structured expressions or code constructs suitable as examples. / The segment lacks clear, meaningful spans and is not well-formed for training purposes; it appears to be a random sequence of words without discernible patterns or structure. / The segment lacks coherence and contains unclear, fragmented elements that do not form meaningful spans for learning purposes. / The text lacks coherent sentences and meaningful context; it appears to be a random sequence of programming expressions without clear structure or patterns for learning span segmentation. / The segment lacks clear structure and meaningful spans; it's a random sequence of words without context or coherence, making it unsuitable for training purposes."}}
{"raw": "Array 03d RenderNode_children [inherited] The immediate children of this RenderNode:", "type": "mixed", "id": {"id": "9f4eac59-558d-4fe3-be74-1d5f39521387"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.6, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment lacks clear delimiters for meaningful spans; it's a mix of programming terminology and unclear text structure, making it difficult to use as training data without further context or formatting. / The segment lacks clear, meaningful spans and is not well-formed for training purposes; it appears to be a fragment with unclear context or syntax issues. / The segment lacks clear, meaningful spans for training; it is a fragment with unclear context and structure. / Contains a mix of programming concepts and language, with clear spans for \"Array\", \"RenderNode_children\" as potential training examples. However, the presence of square brackets may confuse span identification; clean-up could improve clarity. / The segment contains a mix of programming terminology and structured list representation, which can help the model learn span segmentation in both contexts. However, it lacks clarity on what \"Array\" or \"[inherited]\" refers to without additional context."}}
{"raw": "Shape' ) ;\ntrue\nfalse\nParameters:\nclass name Name of class to check for Returns:\ntrue if this object is a or is derived from the given class name. Member Data Documentation\nString 03d ObjectBase className [inherited] The concrete class name for an object derived from ObjectBase: Ifyou want to know if an object is of a certain type you should use objectBase.isAClassName\nvar t = pack.", "type": "mixed", "id": {"id": "b27d39fb-6515-49e0-a7be-758f58af47bb"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "[inherited] The concrete class name for an object derived from ObjectBase: Ifyou want to know if an object is of a certain type you should use objectBase.isAClassName\nvar t \" pack.", "type": "mixed", "id": {"id": "c5440869-ac94-4ee1-9d13-183875423457"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "Note: You may omit the '03d.'. Parameters:\ntype_ name name of Class to create. Valid type names are:\n03d Canvas\n03d CanvasLinearGradient 03d", "type": "mixed", "id": {"id": "c3aa9ba8-b4c9-4308-96d5-cbc83530bf20"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.5, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "Ambiguous structure with unclear span boundaries and potential typographical errors (\"03d.\") that could confuse the model during training. / Ambiguous spans and unclear structure; lacks clear compositional patterns for effective training. / Ambiguous structure with unclear span boundaries; lacks coherence and clarity for effective training. / Ambiguous structure; unclear spans due to repetition and lack of context. / Ambiguous structure with unclear span boundaries; lacks clear compositional patterns for training."}}
{"raw": "Shape ' ) ;\n1 [ true\nfalse", "type": "mixed", "id": {"id": "a426a789-bb96-4d06-8be5-802fb4da0619"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "Note that modifications to this array [e.g: push()] will not affect the underlying Element; while modifications to the members of the array: will affect them. This property is read-only: IndexBuffer 03d Primitive indexBuffer The index buffer for the primitive. If null the primitive is non-indexed\nMaterial 03d", "type": "mixed", "id": {"id": "818c2061-e925-4534-8908-8789e0f239c7"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.6799999999999999, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment contains a mix of technical documentation and programming concepts, with clear references to array modifications affecting underlying elements (code) alongside explanatory text about the index buffer's properties in materials science context (natural language). This blend provides diverse patterns for learning span segmentation across both domains. / The segment contains a mix of technical language and structured data (arrays, properties), which can help the model learn span segmentation in both contexts. However, it lacks clarity due to shorthand notation like \"[e.g.: push()]\". Clean up for better training utility. / The segment contains a mix of technical notes and programming concepts, with clear references to array modifications in the context of an index buffer for primitives; it has identifiable spans that represent meaningful patterns useful for training on span segmentation within code documentation or comments. / Contains both technical terms and structured data, useful for learning span segmentation in a mix of contexts. However, it lacks context which could improve its training utility. / The segment contains a mix of technical notes and programming concepts, with clear references to array modifications affecting elements versus index buffers for primitives in the context of Material 03d. It presents valuable patterns related to code structure that can aid span segmentation learning."}}
{"raw": "WorldViewInverseParamMatrix4' , '03d. WorldViewTransposeParamMatrix4' , '03d. WorldViewInverseTransposeParamMatrix4' , '03d. WorldViewProjectionParamMatrix4' , '03d.", "type": "code", "id": {"id": "b8635cc0-c3af-4388-91ed-8ce20895676d"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.44000000000000006, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / The segment lacks clear, meaningful spans and is not well-formed for training purposes; it appears to be a random sequence of characters rather than structured programming constants or variables. / Lacks clear, meaningful spans; resembles a list of identifiers without context or structure for learning. / The segment lacks meaningful context and clarity; it appears to be a random collection of strings that do not form coherent spans for learning purposes. / The segment lacks meaningful context and clarity; it appears to be a random sequence of characters without discernible patterns or structure for learning span segmentation in the target domain."}}
{"raw": "Transform' )\nt.className F=\n03d. Transform'\n1 [ true\nThis property is read-only: Id 03d", "type": "mixed", "id": {"id": "e980b007-8619-4ca5-a2b8-ba212c7b8c47"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "Returns: number The total number of requests currently known to be streamed: See Also: 03djs io LoadInfo getTotalKnownBytesToStreamSoFar 03djs.io. LoadInfo-getTotalRequestsDownloaded Gets the total requests downloaded s0 far Returns: number The total requests downloaded so far: o3djs.loader Loader Class Reference List of all members Detailed Description A simple Loader class to call some callback when everything has loaded Source o3djs/loaderjs Constructor 03djs loader_Loader(onFinished) Public Member", "type": "mixed", "id": {"id": "936b51e5-e730-4558-84cd-3a56ba72f0ab"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.6199999999999999, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment mixes programming concepts with documentation, lacking clear span segmentation and coherence for training purposes. It also contains typos (\"03djs\" instead of \"o3djs\") which could confuse a model during learning. / The segment mixes documentation and programming elements without clear, consistent structure for effective span segmentation training. / The segment contains a mix of programming concepts and documentation, with clear references to functions/methods (e.g., \"Returns:\", \"See Also\", function names) that can be segmented into meaningful spans for learning purposes. However, the text lacks coherence as it seems like fragments from different sources or contexts combined together without proper explanation which might hinder its utility in training a model effectively. / The segment contains a mix of programming concepts and documentation, but lacks clear structure for meaningful span segmentation; it is not coherent enough to serve as training data. / The segment contains a mix of programming concepts and documentation, but lacks clear structure for meaningful span segmentation; it's too fragmented to serve as effective training data."}}
{"raw": "number? 03djs particles ParticleSpec startTime The startTime of a particle. number 03djs particles ParticleSpec timeRange The life time of the entire particle system.", "type": "mixed", "id": {"id": "28563814-18a9-4f50-880d-3eb78dfbbc54"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.5, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment mixes unrelated terms and lacks clear, coherent patterns for meaningful span segmentation; it appears to be a random collection of words rather than structured content suitable as training data. / The text lacks clear structure and meaningful spans; it's a mix of fragmented phrases without coherent context or patterns for learning span composition. / The segment lacks clear delimiters for meaningful spans; it's a mix of numbers and text without discernible patterns or structure suitable as training data. / The segment lacks clear delimiters for meaningful spans; it's a mix of unrelated terms and phrases without coherent structure or compositional value suitable as training data. / The text lacks clear sentence structure and meaningful context for span segmentation; it appears to be a mix of unrelated terms without coherent patterns."}}
{"raw": "ViewProjectionTransposeParamMatrix4' , '03d.ViewProjectionInverseTransposeParamMatrix4' , '03d. WorldParamMatrix4' ,\n'03d.", "type": "mixed", "id": {"id": "04bb9ae6-9f2f-42cb-aed3-33f6a894d2fe"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "ParamFloat4' ,\n'03d. ParamInteger'  '03d. ParamMaterial' ,\n'03d.", "type": "mixed", "id": {"id": "65903c75-3d40-4438-b281-33942c096317"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "Default true. This is for helping with Param cycles\nIf paramA gets its value from paramB and paramB gets its value from paramA: If you go paramA.value, paramB will evaluate then copy to paramA. If you go paramB value, paramA will evaluate then copy to paramB. If you set paramB.updateInput = false, then: If you go paramA:value, paramB will evaluate then copy to paramA Ifyou go paramB value, paramB just copy paramA. paramA will NOT evaluate when paramB asks for its value. BoundingBox 03d", "type": "mixed", "id": {"id": "8d9017d1-94e8-43b1-9a6d-1eccde478a35"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.32, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / The segment mixes technical descriptions with unclear references (e.g., \"paramA\", \"paramB\") and lacks coherent structure for effective span segmentation training. It also contains a mix of natural language explanations, code-like constructs (\"If you go paramX.value\"), which complicates the learning process without clear boundaries or patterns to learn from. / judge threshold: score 0.200 < 0.250 / The segment contains a mix of configuration-like statements and programming concepts, but lacks clear structure for meaningful span segmentation; some parts are unclear or incomplete (e.g., \"BoundingBox 03d\"). / judge threshold: score 0.200 < 0.250"}}
{"raw": "Each access to this field gets the entire list so it is best to get it just once. For example:\nvar children\nrenderNode _ children;\nfor (var 1 = 0 ; 1 < children. length; i++)\nvar child = children [ i] ;\nNote that modifications to this array [e:g: push()] will not affect the underlying RenderNode; while modifications to the array's members will affect them: This property is read-only:\nString 03d QbiectBase_className [inherited] The concrete class name for an object derived from ObjectBase:", "type": "mixed", "id": {"id": "202c0eb1-af2b-41ae-9758-4a3babbc4a47"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.6, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment contains a mix of programming concepts and comments, but lacks clear structure for meaningful span segmentation; it is not coherent enough as training data. / The segment contains both programming constructs and comments, which can help the model learn span segmentation in a context that includes variable declarations, loops, array manipulations, property accessors (read-only), class names, inheritance notation (\"inherited\"), as well as natural language explanations. This mix provides diverse patterns for learning spans across different contexts within code documentation or mixed content. / The segment mixes programming concepts with unclear references (e.g., \"String 03d QbiectBase_className\") and lacks coherent structure for effective span segmentation training. / The segment contains both programming constructs and comments, which can help the model learn span segmentation for different contexts; however, it lacks coherence as a single training example due to its fragmented nature. / The segment mixes English prose with JavaScript syntax, lacking clear structure for meaningful span segmentation and is not coherent as a whole text piece."}}
{"raw": "createObject ( '03d. Transform )\nt.className SS\n'03d. Transform\n7 | true\nThis property is read-only\nId 93d ObjectBase_clientId [inherited] Unique id of the object. This id will be unique, even across multiple 03D clients in the same page.", "type": "mixed", "id": {"id": "d382f5ef-6bc7-4adf-be54-9d271d9164c0"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.58, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment contains a mix of identifiers and properties that are not clearly structured for meaningful span segmentation; it lacks coherence in both language syntax (natural) and programming context (code). / The segment contains a mix of structured data and unstructured text, but lacks clear span segmentation patterns for effective training. Additionally, the presence of unclear identifiers like '03d' may confuse model learning processes. / The segment mixes language and numerical values without clear structure for meaningful span segmentation; lacks coherence in context. / The segment lacks clear, consistent structure and contains a mix of unrelated elements that do not form coherent spans suitable for training purposes. / The segment lacks clear structure for meaningful span identification, mixing unrelated elements without discernible patterns or coherence suitable for training purposes."}}
{"raw": "Parameters:\nclass name Name of class to check for: Returns: true if this object is a or is derived from the given class name.\n03d. Param unbindInput [inherited] Breaks any input connection coming into the Param:\n03d. Param.", "type": "mixed", "id": {"id": "2a14cc2a-9ff0-41ec-9675-d3b0bb088c9d"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.54, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment lacks clear structure and meaningful spans; it's a mix of unclear text, possibly configuration-like syntax without context or coherence for training purposes. / The segment lacks clarity and coherence, with unclear syntax that impedes meaningful span identification; it mixes language styles without discernible patterns for learning. / The segment lacks clarity and coherence; it mixes programming concepts with unclear syntax, making meaningful span segmentation challenging for training purposes. / The segment lacks clarity and coherence, mixing unrelated terms without clear structure for meaningful span segmentation. / The segment lacks clarity and coherence, with unclear syntax that doesn't provide meaningful spans for learning. It mixes language elements without clear structure or patterns suitable as training data."}}
{"raw": "WorldViewProjectionInverseParamMatrix4' , '03d. WorldViewProjectionTransposeParamMatrix4' ,", "type": "code", "id": {"id": "ae7c6ebe-5997-47e8-91bf-4fe6288c1bc8"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.5, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "Lacks meaningful context; resembles a list of identifiers without clear span segmentation patterns. / lacks clear structure, contains unrecognized tokens and formatting issues. Not representative of clean programming constructs for training purposes. / The segment lacks clear structure and meaningful spans; it appears to be a random sequence of words without discernible patterns or context for effective training. / The segment lacks clear structure and meaningful spans; it appears to be a random sequence of words with no discernible patterns for learning span composition or representing valuable training data. / The segment lacks clear, meaningful spans and is not well-formed for training purposes; it appears to be a random sequence of characters rather than structured programming constants or variables."}}
{"raw": "ObjectBaseclientld [inherited] Unique id of the object:\nThis id will be unique, even across multiple 03D clients in the same page. This property is read-only:\nParam 03d Param inputConnection [inherited] The input connection for this param: This property is read-only:\nString 03d NamedQbiectBasename", "type": "mixed", "id": {"id": "0dacb64f-59dc-42d7-9e1e-04a667519fbe"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.6399999999999999, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment contains a mix of programming terms and unclear text, lacking clear structure for meaningful span segmentation; it's not clean or coherent enough to be representative as training data. / The segment contains a mix of programming language syntax and comments, with clear identifiers for objects (e.g., \"ObjectBaseclientld\") that can be segmented into meaningful spans representing both natural language descriptions (\"Unique id\", \"This property is read-only\") and code constructs. / The segment contains both structured programming elements (e.g., object properties, parameters) and descriptive text that can be segmented into meaningful spans for a span-aware model to learn from. It is well-formed with clear identifiers like \"ObjectBaseclientld\" which are useful patterns in code-related training data. / The segment contains a mix of programming language syntax and documentation, with clear identifiers for objects (ObjectBaseclientld) that can be segmented into meaningful spans such as property names (\"Unique id\", \"inputConnection\") and descriptions (\"This id will be unique...\"). It is clean but lacks context to fully understand the patterns. / The segment lacks clarity and coherence, with unclear references (e.g., \"03D\") that hinder meaningful span segmentation; it also mixes language styles inconsistently."}}
{"raw": "The quotient of a and b.\nb\n!03djs_quaternions Quaterion_ 03djs.quaternions divQuaternionQuaternion\n! o3djs_quaternions Quaterion a\n!o3djs quaternions Quaterion b Divides two quaternions; assumes the convention that a/b = a*(1/b).", "type": "mixed", "id": {"id": "9f07facd-1feb-4fca-8c12-cad32f69ff7b"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.54, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment contains a mix of mathematical notation and programming-like expressions, which can be useful for learning span segmentation in both domains. However, the clarity could improve with better formatting or separation between natural language explanations (e.g., \"The quotient...\") and code constructs (\"!03djs_quaternions Quaterion_ 03djs.quaternions divQuaternionQuaternion\"). / The segment lacks clear, coherent structure and meaningful spans for training purposes; it mixes unrelated elements without discernible patterns or context. / The text lacks clear structure and meaningful spans; it's a mix of unclear notations that don't represent coherent patterns for training purposes. / The segment mixes unclear notations and lacks coherent structure for meaningful span segmentation; it combines elements of both programming syntax (potentially quaternion operations) with ambiguous text (\"The quotient\"). This mix makes the content difficult to parse as either natural language or code, reducing its utility. / The segment lacks clear structure and meaningful spans; it's a mix of unclear text, programming comments, which makes it difficult to use for training purposes."}}
{"raw": "An object tree conforming to the JSON rules. Returns: ! o3djs serialization Deserializer A deserializer object:\n03djs.serialization.deserialize ! o3d Pack pack !", "type": "mixed", "id": {"id": "2a0bdbf0-acd7-4097-903f-59c6e1285a3b"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.32, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The text lacks clear structure and meaningful spans; it appears to be a random collection of characters rather than coherent sentences or programming constructs. / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / The segment lacks clear structure and meaningful spans; it's a mix of JSON-like syntax with unclear references, making it unsuitable for training purposes."}}
{"raw": "Transform' )\nt.className S=\n03d. Transform\n1 | true\nThis property is read-only: Id 03d", "type": "mixed", "id": {"id": "77ae14c2-5969-4617-89b1-acb271b79dc6"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.26, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / The text lacks clear structure and coherence, making it difficult to identify meaningful spans for training purposes. It appears as a random mix of characters rather than structured language or programming syntax."}}
{"raw": "* RPAREN\nargument_expression list expression COMMA expression ) * ) ?", "type": "code", "id": {"id": "7b065d2c-fd69-4cc5-845e-6caaef0d7771"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.5599999999999999, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment lacks meaningful context and contains only punctuation without clear spans for learning; it's not well-formed or representative of typical programming constructs. / The segment lacks meaningful context and clarity; it's a sequence of symbols without discernible structure or compositional value for training purposes. / The segment lacks clear, meaningful spans; it's a sequence of symbols without context or structure that can be learned as training data for span segmentation. / Clear syntactic structure representing valid expressions and operators, useful for learning span composition in programming contexts. / The segment lacks meaningful context and clarity; it's a mix of symbols with no discernible structure or patterns for learning span composition in the target domain."}}
{"raw": "ParamBoundingBox value The BoundingBox stored by the Param:\n03d.", "type": "mixed", "id": {"id": "346ec115-56e2-487d-a792-c2cbe5c8801d"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.38, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / The segment lacks clarity and coherence; it appears to be a fragment with unclear meaning, making meaningful span identification difficult for training purposes. / The segment lacks clarity and coherence, making it difficult to identify meaningful spans or learnable patterns for span segmentation; it's a fragmented piece of text with unclear context. / judge threshold: score 0.200 < 0.250 / Ambiguous structure, unclear spans; lacks coherence for training purposes."}}
{"raw": "Ifyou want to know if an object is of a certain type you should use objectBase.isAClassName\nvar t = pack. createobject ( '03d.", "type": "mixed", "id": {"id": "93ab9d4b-e66a-4fe2-a4fe-f3ead84d9422"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "This property is read-only:\nNumber 03d CurveKeyinput [inherited] The input of this key:\nNumber 03d.", "type": "mixed", "id": {"id": "9eaf1003-6a5f-4f93-a262-00af9ff3b091"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.58, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment lacks clear, meaningful spans and is not well-formed for training purposes; it appears to be a random combination of numbers without context or structure. / The segment contains a mix of structured data (code-like elements) and plain text, with clear span boundaries for 'Number', properties like '[inherited]', which are typical in configuration files or code documentation; however, it lacks context to fully understand the meaning behind these spans. / The segment lacks clear, meaningful spans; it's a mix of numbers and text without discernible structure or patterns for learning span composition. / The segment lacks clear, meaningful spans and is not well-formatted for training purposes; it appears to be a mix of property names with unclear context or structure. / The segment contains a mix of descriptive text and numerical identifiers, which can be segmented into meaningful spans for training purposes; however, the lack of context may limit its utility slightly."}}
{"raw": "[ | true\nThis property is read-only: Id 03d ObjectBase clientld", "type": "mixed", "id": {"id": "82349b92-aa41-402b-8092-66a4bafa4dde"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "number keyCode boolean  control boolean alt boolean shift boolean meta\nCreates a DOM-level 3 KeyboardEvent. see http:/lwww.w3.org/TR/DOM-Level-3-Eventsleventshtml #Events-KeyboardEvents-Interfaces.", "type": "mixed", "id": {"id": "8b66d3bf-8213-42d2-a816-5e94095971a9"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.36, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / The segment mixes programming syntax with a URL and text, lacking clear structure for meaningful span segmentation; it also contains typos (\"lwww\" instead of \"w3c\") which detract from its training utility. / judge threshold: score 0.200 < 0.250 / The segment contains a mixture of programming constructs (keyCode, boolean) and textual content with URLs that can be segmented into meaningful spans for learning purposes. However, the presence of HTML-like tags may confuse non-code-aware models; thus it is rated slightly lower than ideal training data. / judge threshold: score 0.200 < 0.250"}}
{"raw": "indexl The index of the first vertex of the triangle. index2 The index of the second vertex of the triangle. index3", "type": "mixed", "id": {"id": "9bfa587a-d483-4d67-9c71-51670c380f05"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.5, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment lacks clear delimiters for meaningful spans; it's a mix of variable names and comments without context or structure. / The segment lacks clarity and coherence; it's a list of terms without context or structure that can be segmented into meaningful spans for training purposes. / The segment lacks clear delimiters for span segmentation; it's a mix of incomplete words and unclear references to indices without context or syntax clarity. / The segment lacks clear delimiters for span segmentation and is not coherent as a standalone example; it resembles more of an incomplete list than structured content suitable for training. / The segment lacks clarity and coherence; it's unclear what \"indexl\", \"index2\" refer to, making it difficult for the model to learn meaningful span segmentation from this text alone."}}
{"raw": "setCameraPosition(x, Y 2) setCameraTarget(x, Y, 2) setCameraUp(x; Y, 2) setFieldOfView(fieldOfView) setLightColo(r; g, b, a) setLightPosition(x, Y, 2) setZClip(zNear; zFar) viewAlO", "type": "code", "id": {"id": "2dc59d18-4f24-408d-8d7f-05b3e16ee644"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.58, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "Clear structure with identifiable spans; represents valuable patterns for learning span composition in programming context. / Clear structured commands with identifiable parameters; well-suited for learning span composition in programming contexts. / The segment contains a mix of programming commands and text, but lacks clarity in structure for meaningful span segmentation; some syntax errors (e.g., 'Y' instead of 'y', missing semicolons). / The text contains programming commands with inconsistent formatting and unclear semantics, lacking clear span segmentation patterns for training purposes. / The segment contains a mix of programming commands and unclear text, lacking clear structure for meaningful span segmentation."}}
{"raw": "js related to making shaders for normal mapped assets Utilities: 03djs / debug. js: Added createSphere and createCube utilities to let you create those in arbitrary space. Utilities: 03djs /math js:", "type": "mixed", "id": {"id": "27eb4f60-8df7-4701-a400-3bc192c58b6a"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.6599999999999999, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment lacks clear, meaningful spans and is not well-formatted for training purposes; it mixes unrelated elements without discernible patterns or structure. / The segment lacks clear, meaningful spans and is not coherent for training purposes; it mixes unrelated topics without discernible patterns or structure. / Contains both programming constructs and comments, which can help the model learn span segmentation in a context that includes human-readable annotations alongside actual code elements. / The segment contains a mix of programming-related comments and descriptions, which can help the model learn span segmentation in both contexts; however, it lacks clarity due to its informal structure. / Contains both programming-related terms and comments, which can help the model learn span segmentation for a variety of contexts including coding constructs (spans) like \"createSphere\" or \"debug.js\". The segment is clean but lacks full sentences that could improve its natural language training utility."}}
{"raw": "ProjectionInverseTransposeParamMatrix4' , '03d. ViewParamMatrix4' , '03d. ViewInverseParamMatrix4' ,\n'03d. ViewTransposeParamMatrix4' , '03d.ViewInverseTransposeParamMatrix4' , '03d. ViewProjectionParamMatrix4' , '03d.ViewProjectionInverseParamMatrix4' , '03d.", "type": "code", "id": {"id": "8ef6af83-248a-4b73-b13a-a56721cb5107"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "Ifyou want to know if an object is of a certain type you should use objectBase.isAClassName\nvar t \" pack. createObject ( '03d. Transform' ) ;\nt.className F= '03d.", "type": "mixed", "id": {"id": "4ef9a8d9-d9f9-4eda-a920-314bee4c422a"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "Buffer Class Reference\nInherits 03d NamedObiect;\nInherited by 03d IndexBuffer; and 03d", "type": "mixed", "id": {"id": "5e28c7ce-13cc-441b-b353-9a26b4cc8187"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.44000000000000006, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment lacks clarity and coherence, with unclear references (e.g., \"03d\") that hinder meaningful span identification or learning patterns for X-Spanformer training. / The text lacks clear structure and meaningful spans; it's a mix of programming references without coherent sentences or phrases to learn from. / judge threshold: score 0.200 < 0.250 / The segment lacks clear structure and meaningful spans; it's a mix of unclear references that doesn't provide clean patterns for learning span composition. / The text lacks coherence and contains typographical errors, making it difficult to identify meaningful spans for training purposes."}}
{"raw": "Transform' ) ;\nt.className == '03d. Transform'\n[ | true\nThis property is read-only\nFloat4 03d", "type": "mixed", "id": {"id": "a87f3260-2c94-480b-9281-23041f62a414"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.32, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / The segment lacks clear structure and coherence; it mixes programming syntax with unclear text, making meaningful span segmentation difficult. / judge threshold: score 0.200 < 0.250 / The segment lacks clear structure and coherence; it's a mix of programming syntax, comments, and possibly documentation without discernible patterns for effective span segmentation or training utility. / judge threshold: score 0.200 < 0.250"}}
{"raw": "CurveKey output [inherited] The output of this key:", "type": "mixed", "id": {"id": "458c9168-5134-4eca-8516-13d359e15742"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.5, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "Lacks clear, meaningful spans; too fragmented for effective training. / Lacks clear, meaningful spans; too vague for effective training. / Lacks clear, meaningful spans; too ambiguous for training purposes. / Lacks clear, meaningful spans; too vague for training purposes. / lacks clear spans and is not coherent for training purposes. The segment mixes a programming concept with an unclear sentence structure, making it difficult to identify meaningful patterns or segments."}}
{"raw": "Param:= .unbindOutputs [inherited] Breaks all param-bind output connections o this param. Member Data Documentation\nString 03d ObjectBase_className", "type": "mixed", "id": {"id": "8d14ae6a-e04f-45b1-9260-ac86d59d8006"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.6199999999999999, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment contains a mix of programming-like syntax and documentation, with clear structured elements that can be segmented into meaningful spans for training purposes. Despite some unconventional formatting (\"Param:= .unbindOutputs\"), it retains identifiable patterns useful in learning span composition across both code constructs (e.g., \"param\", \".unbindOutputs\") and natural language descriptions (e.g., \"Member Data Documentation\"). / The segment lacks clear structure and meaningful spans; it appears to be a mix of programming syntax, documentation comments (which are not ideal for training), with no coherent pattern or context provided. / The segment contains a mix of programming language syntax and documentation, with clear identifiers like \"Param\" that could be useful for span segmentation in both contexts. However, the lack of context makes it less ideal as is; additional examples would improve its utility. / The segment lacks clear structure and meaningful spans; it's a mix of programming terms, object names, and documentation that doesn't form coherent patterns for learning span composition. / The segment contains a mix of programming language syntax and documentation, with clear structured elements like variable assignments (\"Param:= .unbindOutputs [inherited]\") that can be segmented into meaningful spans for learning purposes. Despite some spelling inconsistencies (e.g., \"String 03d\"), it retains its compositional value as an example representing both code constructs and natural descriptions of them."}}
{"raw": "Number 03d Primitive numberPrimitives The number of rendering primitives (i.e,, triangles, points, lines) the primitive has.", "type": "mixed", "id": {"id": "948a206c-6f1b-4bee-8545-48c2605a6089"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.64, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment contains clear, structured elements with a mix of numbers and text that represent meaningful spans for learning span composition in the context of programming syntax or documentation related to rendering primitives. It is clean but lacks punctuation which could be an issue; however, its relevance as mixed content outweighs this minor flaw. / Contains both numerical and textual elements, with clear references to programming concepts like \"rendering primitives\" which can be segmented into meaningful spans for a span-aware model. The mix of natural language (text) describing code constructs is valuable training data. / The segment contains a mix of numbers, abbreviations (i.e., \"03d\"), and technical terms (\"Primitive numberPrimitives\", \"rendering primitives\") that can be segmented into meaningful spans for learning span composition in both code-related contexts as well as natural language descriptions. / The segment lacks clarity and coherence, with unclear references like \"Number\" followed by a colon which disrupts the flow of information; it also mixes numerical notation (\"03d\") inappropriately within text context. / The segment mixes technical jargon with unclear abbreviations and lacks clear, consistent structure for meaningful span segmentation."}}
{"raw": "bool 03d. ObjectBase.isAClassName String class name [inherited] Takes the name ofa class as an argument, and returns true if this object is either an instance of that class or derives from that class. var t 3 pack. createobject ( '03d.", "type": "mixed", "id": {"id": "c3ad50d6-2c7d-4158-8ef3-743fdf5b8141"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "Reimplemented in 03d NamedQbiect: Array 03d Param outputConnections [inherited] The output connections for this param:\nThis property is read-only\nbool 03d Param readOnly [inherited] If true the param is read only: Its value can not be set nor can it be used as the destination in a ParamBind\nThis property is read-only: bool 03d", "type": "code", "id": {"id": "6b911312-8a35-4658-872f-5b3d1e46c5dd"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.58, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment lacks clear, meaningful spans due to inconsistent formatting and unclear references (e.g., \"03d\"). It is not coherent or representative of typical programming constructs for training purposes. / The segment lacks clear, meaningful spans due to the presence of non-standard characters and unclear references (e.g., \"03d\"). It also contains repeated phrases (\"This property is read-only\") which do not provide diverse patterns for learning span segmentation or composition in a tokenizer-free context. / Clear structured elements with meaningful spans; well-formatted for training purposes, representing valuable patterns in span composition. / The segment lacks clarity and coherence, with unclear references (e.g., \"03d\") that hinder meaningful span identification; it does not represent clean patterns for learning. / The segment lacks clear, meaningful spans due to its technical jargon and lack of context; it's not coherent for training purposes."}}
{"raw": "In both cases, a DOCTYPE is probably required. You can also request certain features by adding the attribute '03d_features' as in\n<div id-\"03d\" 03d_features-_\"FloatingPointTextures\" ><ldiv>", "type": "mixed", "id": {"id": "e6bd0a73-5c33-4533-acc2-fb078b10283e"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "!03d Transform 03djs.canvas CanvasQuad.scaleTransform scale transform for this quad. You can change the scale the quad without effecting its positon using this transform:\n!03d Transform 03djs.canvas CanvasQuad.transform transform for this quad.\n03djs.debug DebugHelper Class Reference List of all members_\nDetailed Description", "type": "mixed", "id": {"id": "6c60b4da-abc0-4efc-924d-6515d9a9cdab"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "Public Member Functions addLine(index l , index2) addVertex(positionX , positionY, positionz) Io3d Shape   createShape(pack, material) reorient(matrix)\nPublic Properties undefined Offset\nConstructor\n03djs.debug: VertexInfo ! Array<lo3djs math Vector3 opt vertices ! Array <number> opt_indices VertexInfo. Used to store vertices and indices.", "type": "mixed", "id": {"id": "f5efd388-5247-40cc-8c20-61afdc165617"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.6199999999999999, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "Contains both programming constructs (functions, properties) and comments; spans can be identified for learning purposes. However, the presence of non-standard characters like '03djs' may affect clarity slightly. Overall clean but requires preprocessing to handle such anomalies. / The segment lacks clarity, mixing unrelated concepts and lacking coherent structure for meaningful span segmentation. / The segment contains a mix of programming constructs and comments, but lacks clear structure for meaningful span segmentation; it's not coherent enough as training data. / The segment contains a mix of programming constructs and comments, which can help the model learn span segmentation in both contexts. However, it lacks clarity due to undefined properties/methods like 'Offset' and unclear function names ('addLine', 'createShape'). / The segment contains a mix of programming constructs and comments, with clear indications for span segmentation such as function names (\"addLine\", \"createShape\"), properties (\"Offset\"), methods (\"reorient(matrix)\"), which are valuable patterns to learn from. However, the presence of natural language (comments like \"Public Member Functions\") slightly reduces clarity but still maintains compositional value."}}
{"raw": "Transform' )\nt.className S=\n03d.", "type": "code", "id": {"id": "00452ebd-6d7a-4111-8901-bba6fb3898df"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "Transform ) ;\nt.className F= '03d.", "type": "mixed", "id": {"id": "6ceedaaf-c585-4b9b-8ed0-99e4409a652a"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "SourceBlendFunction\nState. BLENDFUNC   ONE\ndefault\n[ParamInteger; IState BlendingFunction\n(03d.", "type": "mixed", "id": {"id": "07878735-d9a1-4838-8c51-9d68f0464a5f"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "BITWISE OR ASSIGN <<= >>= & = =", "type": "code", "id": {"id": "53cea353-a456-4caf-81ae-f3d5e1a24590"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.5, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment lacks meaningful context and contains only isolated symbols without discernible patterns or clear structure for span segmentation. It is not representative of typical programming constructs that would be useful in training a tokenizer-free, span-aware model like X-Spanformer. / The segment lacks meaningful context and clarity; it's a random sequence of operators without discernible patterns or structures for learning span composition. / The segment lacks meaningful context and contains only operators without clear spans or compositional patterns for learning span segmentation; it's not coherent as programming instructions. / The segment lacks meaningful context and clarity; it appears to be a random assortment of operators without discernible patterns for learning span composition in programming constructs. / The segment lacks meaningful context and clarity; it's a random sequence of operators without discernible structure or patterns for learning span composition."}}
{"raw": "VertexBufferBase: List of all members", "type": "mixed", "id": {"id": "48a3d183-ceae-495e-b042-a17aada3c8df"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.6, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "Clear structure with a heading and list of members, representing both conceptual (natural language) elements (\"List\") and technical constructs (\"VertexBufferBase\"). Suitable for learning span composition in diverse contexts. / The segment lacks context and clarity, making it difficult to identify meaningful spans or learnable patterns for span segmentation; it's not coherent as a standalone example. / The segment contains a mix of programming terminology and documentation structure, which can help the model learn span segmentation in both contexts. However, it lacks context for meaningful interpretation or learning patterns beyond this single example. / The segment lacks context and clarity, making it difficult to identify meaningful spans for training purposes. It combines a programming concept with an incomplete sentence structure that doesn't provide clear patterns or examples of span segmentation in either natural language or code contexts. / The segment lacks context and clarity, making it difficult to identify meaningful spans for training purposes. It appears more like a fragment or heading rather than structured content suitable for learning span composition in X-Spanformer."}}
{"raw": "[inherited] The number of components in this field:\nThis property is read-only. Number 03d", "type": "mixed", "id": {"id": "03f48cee-021f-4392-92ce-d19f92302d97"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.5, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment lacks clear structure and meaningful spans; it's a mix of metadata (\"inherited\") with unclear references (e.g., \"03d\"). It doesn't provide coherent patterns for training purposes. / The segment lacks clear span boundaries and contains a mixture of text with unclear references (e.g., \"Number 03d\"). It's not well-formed for training purposes as it doesn't provide distinct, learnable patterns or meaningful spans that can be identified without additional context. / The segment lacks clear, meaningful spans and is not coherent for training purposes; it mixes documentation with unclear references (\"03d\"). / The segment lacks clear structure and meaningful spans; it's a mix of comments, property names, numbers without context or coherence for training purposes. / The segment lacks clear, meaningful spans for training; it's a mix of metadata and possibly documentation with unclear context or structure."}}
{"raw": "SourceBuffer 03d State 03d StateSet\n03d StreamBank", "type": "code", "id": {"id": "b7c949dc-b2f6-4b2e-94d3-ce5c285bd3f7"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.5, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The text lacks meaningful context and clear span boundaries for learning; it resembles a sequence of identifiers rather than structured programming constructs or documentation. / The segment lacks context, clarity on what spans represent meaningful units; it's a sequence of identifiers without clear delimiters or patterns for learning span composition. / The segment lacks meaningful context and clear span boundaries for learning; it's a sequence of identifiers without discernible patterns or compositional value in the target domain (code). / The segment lacks context and meaningful structure for learning span segmentation; it's a list of identifiers without clear compositional patterns. / Insufficient context and unclear span boundaries for meaningful training examples."}}
{"raw": "[inherited] The concrete class name for an object derived from ObjectBase: Ifyou want to know ifan object is of a certain type you should use objectBase.isAClassName\nvar t\npack. createObject ( '03d.", "type": "mixed", "id": {"id": "daadbaca-b6d7-4dfd-804f-80b8d8d852ad"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "Transform' ) ; t.isAClassName ( '03d.", "type": "mixed", "id": {"id": "2e60e91a-b49d-49f1-b922-f821d4be0696"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "o3djs_picking Ray  clientPosition ToWorldRax(clientXPosition, client YPosition; drawContext; clientWidth; clientHeight) <static> !o3djs picking_L Ray clientPositionToWorldRayEx(clientXPosition, clientYPosition; view, projection, clientWidth, clientHeight) <static > ! 03djs picking PickInfo   createPickInfo(shapeInfo, rayIntersectionInfo, worldIntersectionPosition) <static > !", "type": "mixed", "id": {"id": "af28428c-4e73-4e49-8781-07dd11efb058"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.44000000000000006, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment contains a mix of programming functions and comments, but lacks clear structure for meaningful span segmentation; it's not coherent enough as training data. / The segment contains a mix of programming functions and comments, but lacks clear structure for meaningful span segmentation due to the presence of non-standard characters (e.g., \"o3djs\", \"<static>\") and inconsistent formatting. Additionally, it includes both code constructs (\"Ray clientPositionToWorldRax(...)\") mixed with what appears as pseudo-code or malformed text fragments which could confuse a tokenizer-free model during training. / The segment contains a mix of programming functions and comments, but lacks clear structure for meaningful span segmentation due to the presence of non-standard characters (e.g., 'â' instead of 'a') and unclear syntax which could confuse training data evaluation. / judge threshold: score 0.200 < 0.250 / The segment contains a mix of programming functions and comments, but lacks clear structure for meaningful span segmentation; the presence of multiple languages (code with English-like syntax) complicates training data suitability."}}
{"raw": "4-by-4 matrix stored by the Param by a length-4 array of arrays of 4 numbers", "type": "mixed", "id": {"id": "ec7e9055-0743-4cce-a184-894f59f4b8b3"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.6599999999999999, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment lacks clarity and coherence, making it difficult to identify meaningful spans for training purposes. It combines a mathematical concept with programming terminology in an unclear manner. / Lacks clear structure for meaningful span segmentation; ambiguous and poorly formed. / The segment combines both a numerical description and programming-related terminology, indicating potential for learning span segmentation in the context of software documentation or configuration files. / The segment contains a clear description of data structure (matrix) and its representation in programming terms, which is valuable for learning span segmentation across both domains. However, the sentence could be clearer to improve readability without losing meaning. / The segment contains a mix of numerical and textual information that could be useful for learning span segmentation in both programming contexts (code) and mathematical descriptions, though it lacks clarity on the exact structure or meaning behind \"Param by.\" More context would improve its utility as training data."}}
{"raw": "Detailed Description The Buffer object is a low level container for a flat list of floating point or integer values. These are currently used to define geometry: Public Member Functions bool allocateElements Number num_elements) Field createField (String field_type, Number num_components) removeField (Field field) bool set (RawData raw_data) bool set (RawData raw_data, size_ t offset; size_ t length) bool isAClassName (String class_name) Public Attributes Number numElements Number totalComponents Array", "type": "mixed", "id": {"id": "51c4bef4-79df-4a50-9a2d-1246d0c7fb08"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.6399999999999999, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment mixes programming concepts with unclear syntax and lacks coherent structure for meaningful span segmentation; it is not well-suited as training data. / The segment contains clear, structured elements like class names and function signatures that can be segmented into meaningful spans for learning span composition in a tokenizer-free context. It is well-formed with public member functions indicating methods of an object-oriented programming structure which are representative patterns useful to the model's training process. / The segment contains a mix of programming concepts and language, with clear attributes (e.g., 'numElements', 'totalComponents') that can be used to learn span segmentation in both natural text descriptions ('Detailed Description') and code constructs ('Public Member Functions'). / The segment contains a mix of programming concepts and language, with clear attributes like 'numElements' that can be used for span segmentation; however, it lacks context which could improve its training utility. / Contains a mix of programming concepts and language, but lacks clear span segmentation for effective training. The text is not well-formed or coherent enough to serve as meaningful examples without further context or clarification on the structure it represents."}}
{"raw": "Number 03d ClearBuffer_clearDepth The value to clear the depth buffer (0.0 to 1.0)\nbool 03d", "type": "mixed", "id": {"id": "bc062164-9a41-415d-9ff4-a063b99c3b52"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.5, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment lacks clarity and coherence; it's a mix of numbers, words with unclear context (\"Number\", \"bool\"), making it difficult to identify meaningful spans or learnable patterns for span segmentation in either natural language or code contexts. / The segment lacks clarity and coherence; it's a mix of numbers, words with unclear context (\"Number\", \"bool\"), making it difficult to identify meaningful spans for training purposes. / The segment lacks clarity and coherence, mixing numbers with unrelated words (\"Number\", \"bool\") without clear structure or context for meaningful span segmentation. / The segment lacks clarity and coherence; it's a mix of unclear references (\"Number 03d\") with ambiguous terms like \"ClearBuffer_clearDepth\" which do not form meaningful spans for training purposes. / The segment lacks clarity and coherence, mixing numerical identifiers with unclear text (\"Number\", \"03d ClearBuffer_clearDepth\"), making it difficult to discern meaningful spans for training purposes."}}
{"raw": "String className\nMember Function Documentation\n03d. CurveKey destroy [inherited] Destroys this key; removing it from its owner:\nbool 03d. ObjectBase.isAClassName String class name [inherited] Takes the name ofa class as an argument, and returns true if this object is either an instance of that class or derives from that class. var t 3 pack. createobject ( '03d.", "type": "mixed", "id": {"id": "b0ffa724-594f-4bae-8a80-d5fbb436dead"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "03d Texture2D\n03d TextureCUBE\n03d TickCounter 03d Transform\n03d TreeTraversal\n03d VertexBuffer\n03d", "type": "code", "id": {"id": "43584d4c-e9e6-4c76-a1c8-8ca3e6798db3"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.5, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment lacks meaningful context and clarity for span segmentation; it's a list of seemingly unrelated terms without clear patterns or structure. / The segment lacks meaningful context and clarity for span segmentation; it's a list of terms without clear relationships or patterns. / The segment lacks meaningful context and clarity for span segmentation; it's a list of seemingly unrelated terms without clear structure or patterns. / The segment lacks clear, meaningful spans and is not well-formed for training purposes; it appears to be a list of identifiers or labels without context. / The segment lacks meaningful context and clarity for span segmentation; it's a list of seemingly unrelated terms without clear patterns or structure."}}
{"raw": "Transform' ) ; t.className F== '03d Transform' ; 1 | true\nThis property is read-only:", "type": "mixed", "id": {"id": "6dbb56be-3298-4b83-903c-fd84251c84b0"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "ParamQbject_params [inherited] Gets all the param on this param object: Each access to this field gets the entire list, so it is best to get it just once. For example:\nvar params = paramObject.params ;\nfor (var 1 = 0 ; 1\nparams .", "type": "mixed", "id": {"id": "0884fcb6-9c4f-4f54-98be-77cfd5c784c6"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "Transform' ) ; true\nt.isAClassName ( '03d. ParamObject' ) ; 7 [ true t.isaClassName ( '03d.", "type": "mixed", "id": {"id": "43d181ac-ffed-4155-ba88-1589ce59d025"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "paramB.value, paramB just copy paramA. paramA will NOT evaluate when paramB asks for its value. Matrix4 03d ParamMatrix4 value [inherited] Sets the 4-by-4 matrix stored by the Param by a length-4 array of arrays of 4 numbers. 03d.", "type": "mixed", "id": {"id": "fad68090-dba6-4be6-ab08-6bc02f73682d"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.6799999999999999, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment contains both programming concepts (parameters, matrices) and comments that can be segmented into meaningful spans for learning span composition in a tokenizer-free context. It is clean but lacks contextual clarity due to the mix of code-like syntax with natural language explanations. / The segment contains a mix of programming concepts and language, with clear spanable elements like parameter names (paramA, paramB), matrix references (\"Matrix4\", \"03d\"), which can be useful for learning context-aware spans in both code syntax understanding and natural language processing. / The segment contains both programming concepts (parameters, matrices) and comments that can be segmented into meaningful spans for a span-aware model to learn from. It is clean but lacks context which could improve its utility as training data. / Contains both programming concepts and language, with clear spanable elements like 'paramB.value', but lacks coherence in explanation. Needs context for better learning utility. / The segment contains both programming concepts (parameters, matrices) and comments that are structurally clear for span segmentation; it represents a valuable pattern of interaction between parameters in the context of coding conventions."}}
{"raw": "<static> boolean IsChromelO( <static > boolean  IsMSIEC <static > !Array:<string  parseErrorStack(excp) <static > boolean  readyO) <static > setErrorHandler(client) <static > snapshotProvidedNamespaces\nPublic Properties <static > 03d.03d 03d\nMember Function Documentation\nstring 03djs.base.formatErrorStack Array <string stack Pretty prints an exception's stack, if it has one. Parameters: stack An array of errors. Returns: string The pretty stack. string 03djs.base getFunctionName ! function(__): *", "type": "mixed", "id": {"id": "d6ebf7f4-abc3-4c88-a354-d79de71ceb95"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "Functions !", "type": "mixed", "id": {"id": "00957498-1040-4ea7-a609-f441fd868e82"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "WorldInverseParamMatrix4' ,\n'03d. WorldTransposeParamMatrix4' , '03d. WorldInverseTransposeParamMatrix4' , '03d. WorldViewParamMatrix4' ,\n'03d. WorldViewInverseParamMatrix4' ,\n'03d.", "type": "mixed", "id": {"id": "c82b0e3b-52ab-4e8d-9133-ceca3bcd8dfb"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "ParamMatrix4' ,\n'03d ParamParamArray' '03d. ParamRenderSurface' ,\n'03d.", "type": "mixed", "id": {"id": "1ec3e415-bd38-4bea-9729-6fbf0a366c1c"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "fields String name Id clientld String className Member Function Documentation bool 03d. Buffer.allocateElements Number num_elements Allocates memory for the data to be stored in the buffer based on the types of fields set o the buffer Parameters: num elements Number of elements to allocate. Returns: True if operation was successful. Field 03d.", "type": "mixed", "id": {"id": "6c00c7e5-8ff7-4c18-ba53-816743395e9c"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.6599999999999999, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment contains a mix of programming concepts (fields, buffer.allocateElements) and documentation style text (\"Member Function Documentation\"). It has clear spans that can be identified as both code constructs ('buffer.allocateElements') and natural language descriptions ('Field 03d'). Despite some grammatical issues in the description 'bool 03d.', it retains enough clarity for training purposes. / The segment contains a mix of programming concepts and documentation, with clear spans for fields (natural language) and method signatures/code constructs (code). However, the clarity could be improved due to some typos (\"clientld\" instead of \"clientId\") which might confuse learners. / The segment contains both structured programming elements (like function names and parameters) as well as documentation text, providing a diverse range of patterns for span segmentation in the context of X-Spanformer training. / The segment mixes unclear field names and lacks clear span boundaries for effective training. It combines elements of both programming language syntax (like function documentation) with ambiguous strings (\"String name Id clientld String className Member Function Documentation bool 03d\"), which complicates the identification process necessary to train a tokenizer-free, span-aware model like X-Spanformer effectively. / The segment contains a mix of programming concepts and documentation, with clear spanable elements like function names (\"Buffer.allocateElements\"), parameters (e.g., \"num_elements\", \"True\"), return values (\"False if unsuccessful\") which are valuable for learning code-related patterns in natural language."}}
{"raw": "t.isAClassName ( '03d. Transform' ) ; t.isAClassName ( '03d.", "type": "code", "id": {"id": "d8579699-950f-4da9-9921-145f457bcaac"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.44000000000000006, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / The text lacks clarity and coherence; it's a malformed snippet of what appears to be programming class names, but the structure is not clear enough for meaningful span segmentation or learning patterns in this context. / The segment lacks clear delimiters for meaningful spans; it's malformed and not representative of typical class naming conventions in programming languages, making it unsuitable as training data. / The text lacks clear delimiters for meaningful spans and contains syntax errors, making it unsuitable as is for training purposes. / The segment lacks clarity and coherence, with unclear structure that doesn't represent meaningful spans for learning span composition. It appears to be a malformed combination of programming elements without clear context or syntax correctness."}}
{"raw": "length; i++) params [ i] ;\nvar param", "type": "mixed", "id": {"id": "a304044d-40a7-4838-b7a5-06e460370578"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.5, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment lacks clarity and coherence; it mixes programming syntax with unclear text, making meaningful span segmentation difficult for a tokenizer-free model to learn from. / The segment lacks clarity and coherence, mixing syntax errors with unclear variable names; it doesn't provide a clear pattern for span segmentation or composition. / The segment lacks clear delimiters for meaningful spans and contains syntactical errors, making it unsuitable as training data. / The segment lacks clear structure and meaningful spans; it's a mix of programming syntax with unclear context, making it difficult for the model to learn span composition effectively. / The segment lacks clarity and coherence, mixing programming syntax with unclear variable names; it's not well-suited for training purposes due to its ambiguous structure."}}
{"raw": "Shape' ) ; false\nParameters:\nclass name Name of class to check for Returns: true if this object is a or is derived from the given class name.", "type": "mixed", "id": {"id": "0da2a18b-363b-444a-895c-46dc16ac7f66"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.58, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The text lacks clear sentence structure and contains programming-like syntax without proper context or formatting, making it difficult to segment into meaningful spans for training purposes. / The segment lacks clarity and coherence, with a mix of programming syntax that is not well-defined or structured for training purposes. It combines elements in an unclear manner without distinct spans to learn from. / The segment contains a mix of programming-like syntax and comments, which can help the model learn span segmentation in both contexts. However, it lacks clarity due to incomplete sentences (\"Shape' ) ; false\") and ambiguous phrases like \"Name of class\". / Contains both programming concepts (class names, inheritance) and descriptive text; spans can be identified as 'Parameters' section with class details and return values. / The segment lacks clear sentence structure and meaningful spans; it's a mix of programming syntax with unclear documentation, making it difficult for the model to learn span segmentation effectively."}}
{"raw": "Parameters: a Operand quaternion: b Operand quaternion. Returns: lo3djs_quaternions Quaterion The quaternion quotient a / b.\n! o3djs_quaternions Quaterion _\nlo3djs_quaternions Quaterion q", "type": "mixed", "id": {"id": "903bd1be-0f6a-4da2-9c30-04414505e914"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.54, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment lacks clear structure and coherence; it's a mix of unclear text, programming-like syntax without context or meaningful patterns for span segmentation. / The text lacks clear structure and meaningful spans; it appears to be a mix of random characters, symbols, and incomplete phrases that do not represent coherent patterns for learning span segmentation or composition in natural language processing tasks. / The segment lacks clear delimiters for meaningful spans and contains a mix of unclear text, programming-like syntax without context or clarity on the type (natural language vs. pseudo-code). It is not well-formed enough to serve as training data due to its ambiguity in representing structured patterns necessary for learning span segmentation effectively. / The segment lacks clear sentence structure and contains ungrammatical phrases, making it difficult to identify meaningful spans for training purposes. Additionally, the repetition of \"Quaterion\" without context diminishes its compositional value as a learning example. / The segment contains a mix of programming concepts and comments, with clear delimiters for spans that could be useful in training an encoder to understand both language constructs (like function names) and mathematical expressions or code syntax. However, the presence of non-standard characters ('_') may confuse some models; cleaning up this text might improve its utility as training data."}}
{"raw": "Object json Deserializes a transform graph Parameters: pack The pack to create the deserialized objects in: json An object tree conforming to the JSON rules. 03djs.serialization deserializeArchive !o3djsioarchivelnfo archiveInfo string sceneJsonUri Io3d Client client ! o3d", "type": "mixed", "id": {"id": "f5504034-92b7-485d-b1db-ac8c6afd721f"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "ObjectBase clientld [inherited] Unique id of the object:\nThis id will be unique, even across multiple 03D clients in the same page. This property is read-only:\nParam 03d Param inputConnection [inherited] The input connection for this param: This property is read-only: String 03d", "type": "mixed", "id": {"id": "a495a3e6-4165-4c37-8796-347a397191cf"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.58, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment contains a mix of programming language syntax and comments, with clear structured elements like object properties that can be segmented into meaningful spans for learning purposes. However, the presence of typos (e.g., \"clientld\" instead of \"client\") may affect clarity slightly but still retains its compositional value as it represents code patterns mixed with natural language explanations. / The segment contains a mix of unclear text and programming-like syntax, lacking clear spans for effective training. Additionally, there are typographical errors (\"clientld\" instead of \"Client\", missing quotes around strings) that reduce its coherence as clean data. / The segment contains a mix of programming language syntax and comments, which can help the model learn to distinguish between different types of spans in both contexts. However, there are some inconsistencies with spacing that could be improved for clarity. Overall it has good structural elements suitable as training data. / The segment contains a mix of unclear and malformed elements; lacks clear, consistent spans for effective training. / The text contains a mix of programming language syntax and comments, but lacks clear structure for meaningful span segmentation due to the presence of typos (\"clientld\" instead of \"Client\", etc.) and unclear boundaries between code elements and natural language descriptions."}}
{"raw": "bool 03d. ObjectBase.isAClassName String class name [inherited] Takes the name of a class as an argument, and returns true if this object is either an instance of that class or derives from that class. var t = pack. createObject ( '03d. Transform' ) ; t.isAClassName ( '03d.", "type": "mixed", "id": {"id": "b1e5cb33-abef-4568-b3d0-f64bf12cb484"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.2, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "( 'a' | 'A') ( 't' |'T') ('r' | 'R') ('1'|'I') ( 'x' |'X') ; NAMESPACE namespace\" NOINTERPOLATION nointerpolation' ; NOPERSPECTIVE noperspective' ; T OUT out RETURN return' REGISTER register' ROW MAJOR row major' ; SHARED shared' STATEBLOCK stateblock' ; STATEBLOCK STATE stateblock state' ; STATIC static' STRING ('s ' | 'S' ) ( 't' |'T') ( 'r' | 'R') ('1' |'I')", "type": "code", "id": {"id": "271c8ee6-e638-4555-a1ea-7f2811fdbb32"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.32, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment lacks clear, meaningful spans and is not well-formed for training purposes; it's a random mix of characters without discernible patterns or context. / The segment lacks clear, meaningful spans; it appears as a random sequence of characters and symbols without discernible patterns or context for learning span segmentation in programming constructs. / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "ParamObject' ) ; t.isAClassName ( '03d. Shape' ) ;\ntrue\ntrue\nfalse\nParameters:\nclass name Name of class to check for: Returns:\ntrue if this object is a or is derived from the given class name. Member Data Documentation\nString 03d ObiectBase_className [inherited] The concrete class name for an object derived from ObjectBase: Ifyou want to know if an object is of a certain type you should use objectBase.isAClassName\nvar t \" pack.", "type": "mixed", "id": {"id": "950c8b4d-b3a6-450b-a67a-61836e41d6ff"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.22000000000000003, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250 / The segment lacks clear structure and coherence, mixing programming concepts with unclear syntax; it doesn't provide clean patterns for learning span segmentation or composition. / judge threshold: score 0.200 < 0.250 / judge threshold: score 0.200 < 0.250"}}
{"raw": "Member Function Documentation\nArray 03d. UInt32Field:= getAt Number start_index, Number num elements\nGets the values stored in the field\nParameters:\nstart index index of the first value to get: num elements  number of elements to read from field. Returns:\nThe values of the field. bool 03d.", "type": "mixed", "id": {"id": "3cf6fdd9-13a7-4679-aab3-4395d5d9b664"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.6599999999999999, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment lacks clear structure for meaningful span segmentation due to the presence of programming syntax and documentation style combined in an unclear manner, which complicates learning patterns effectively. / The segment contains a mix of programming concepts and documentation, with clear spans for function names (\"Member Function\"), parameters (\"start index\", \"num elements\"), return types (\"The values of the field.\"), which are useful patterns to learn span segmentation in code context. / The segment mixes documentation style with programming syntax, making it difficult to isolate clear spans for training purposes without a tokenizer or additional context parsing mechanisms. / The segment contains a mix of programming concepts and documentation, with clear spans for function names (\"Member Function\"), parameters (start index/index), return values ('The values'), types ('UInt32Field', 'bool'). It is coherent but lacks context to fully evaluate compositional value. / The segment contains a mix of programming documentation and structured data, with clear spans for function names (\"Member Function Documentation\"), parameters (\"start index\", \"num elements\"), return values (\"The values of the field.\"), which can be useful to learn span segmentation in both natural language descriptions (e.g., 'Gets', 'Parameters') and code constructs."}}
{"raw": "ParamOpl 6FloatsToMatrix4 03d TRSToMatrix4\nReturns:\nThe created object. TextureZD 03d. Pack createTexture2D\nNumber width, Number height; Texture Format   format, Number levels, bool enable_render_surfaces\nCreates a new TextureZD object of the specified size and format and reserves the necessary resources for it. Note: If enable render surfaces is true, then the dimensions must be a power of two.", "type": "mixed", "id": {"id": "cd6fce7e-1136-47d3-95b7-fdbe7c315f63"}, "meta": {"status": "discard", "tags": ["discard"], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.6799999999999999, "source_file": "63892020-The-o3d-Bible-by-Kara-Rawson.pdf", "notes": "The segment contains a mix of programming concepts and function descriptions, with clear spanable elements like parameters (\"ParamOpl\"), functions (\"Returns\", \"Creates\"), object names (\"TextureZD\"), attributes (e.g., \"FloatsToMatrix4\"), which are valuable for learning the composition in both natural language explanations within code comments/documentation. / The segment contains a mix of programming concepts and descriptions, with clear spanable elements like function names (ParamOpl), parameters (\"FloatsToMatrix4\", \"TRSToMatrix4\"), object creation commands (\"CreateTexture2D\"), properties (\"width\", \"height\"), formats (\"format\"), conditions (\"enable_render_surfaces\"). It is coherent for training purposes. / The segment contains a mix of programming constructs and comments, with clear structure for span segmentation; however, it lacks coherence due to the presence of unrelated elements like \"ParamOpl\" which may confuse learning patterns. / The segment mixes programming concepts with unclear notations and lacks coherent structure for meaningful span segmentation; it appears to be a mix of pseudo-code or an incorrect transcription rather than clean, well-formed code or natural language text. / The segment contains a mix of programming constructs and comments, with clear parameters (ParamOpl), function names (FloatsToMatrix4, TRSToMatrix4, createTexture2D), return types ('The created object.'), arguments for functions (width, height; format, levels, enable_render_surfaces) that can be segmented into meaningful spans. It is clean and coherent but lacks context or natural language explanation which could improve its utility as training data."}}
