{"raw": "Thus additional substitution instances of the propositional function F V (Cy: Hx)\" are Fa v (Ga: Ha) , Fh V (Gh: Ih)'", "type": "mixed", "id": {"id": "42e9d38e-b92a-431d-bd34-92cf9a569c7e"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.74, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "The segment contains a mix of mathematical notation and logical expressions, with clear structured elements that can be segmented into meaningful spans for learning span composition in both domains. / The segment contains a mix of symbolic expressions and logical notation, which can be segmented into meaningful spans for learning span composition in both mathematical logic contexts (code-like) and formal language structures (natural). It is clean but may require domain-specific knowledge to fully understand the context. / Clear structured patterns with logical expressions and nested functions, suitable for learning span segmentation in programming contexts. / Contains a mix of symbolic expressions and logical notation, which can be segmented into meaningful spans for learning complex span compositions in both mathematical logic contexts (code) and formal language structures (natural). / Clear syntactic structure with identifiable spans; represents valuable patterns for learning span composition in programming contexts."}}
{"raw": "be contingent or contingencies. For example, P, ~P P V G, p* 4, and p 3 q are contingent statement forms; and B, C, ~B, ~C, B-C, Bv C are contingent statements The term is appropriate, since their truth values are not formally determined but are dependent or contingent upon what happens to be the case. It is easily proved that p 3 (q 5 p) and ~p 3 (p 3 q) are tautologies.", "type": "natural", "id": {"id": "3c40bffc-cf4b-4f1e-a052-b6f976d160fc"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear sentence structure with identifiable spans; useful for learning context and logical expressions in English text. / The text segment contains clear logical structures and relationships between statements, which can be segmented into meaningful spans for learning span composition in a tokenizer-free context. It is coherent but lacks explicit coding constructs or domain-specific jargon that could enhance its utility as mixed-type training data. / The text segment contains clear logical structures and expressions that can be segmented into meaningful spans, such as \"p V G\", \"~P P\", etc., which are representative of propositional logic patterns in formal reasoning contexts. It is clean for training purposes but lacks domain-specific jargon or context clues to improve its utility further. / Clear sentences with logical structures; useful for learning span segmentation in complex statements. / The text segment contains clear logical structures and statements that can be segmented into meaningful spans, representing valuable patterns for learning span composition in the context of formal logic or philosophical arguments within natural language. It is clean but lacks explicit code constructs to classify as \"code\"."}}
{"raw": "that there is some one thing such that everything attracts it. Where two quantifiers are applied successively to one propositional function, if they are both universal or both existential, their order does not matter, as is shown by the equivalence of formulas 1 and 2,3 and 4, and 5 and 6. But where one is universal and the other existential, the order of general- ization 0r quantification is very important.", "type": "natural", "id": {"id": "c1f0ae5b-98f0-4679-896e-8b2f62e872a5"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear prose with identifiable patterns of quantifiers and propositional functions, suitable for learning span segmentation in a tokenizer-free context. / Clear sentence structure with identifiable spans; useful for learning complex linguistic patterns. / Clear prose with identifiable meaningful spans; well-formed for training purposes, though somewhat abstract in nature. / Clear structure with identifiable spans; useful for learning complex sentence patterns and logical constructs in text. / Clear prose with identifiable logical structures and quantifier patterns useful for learning span segmentation in a tokenizer-free context."}}
{"raw": "When expressed in English as A true statement is implied by any statement whatever and as A false statement implies any statement whatever they seem rather strange. They have been called by some writers the paradoxes of material implication.", "type": "natural", "id": {"id": "ae7eafda-a31f-4314-867d-2856378fb993"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.78, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear, coherent prose with identifiable sentences and phrases suitable for learning span segmentation in English text. / Clear sentence structure with identifiable phrases and clauses suitable for learning span segmentation in English text. / Clear, coherent prose with identifiable sentences and phrases suitable for learning span segmentation in English text. / Clear, coherent sentences with implied logical structures suitable for learning span composition in English text. / Clear, coherent prose with identifiable sentence structures suitable for learning span segmentation in English text."}}
{"raw": "If he has his old car repaired, then he will owe a lot of money to the garage.", "type": "natural", "id": {"id": "1d11aa5e-7ea9-452a-9f1f-1695ad0b7aae"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.74, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear sentence structure with identifiable subject, verb phrase and object; suitable for learning span segmentation in English prose. / Clear sentence structure with a conditional clause and main action, suitable for learning span segmentation in English prose. / Clear sentence structure with identifiable spans (subject, verb phrase). Well-suited for learning span composition in a tokenizer-free context. / Clear sentence structure with identifiable subject, verb phrase and object; represents a coherent pattern for span segmentation in English text. / Clear sentence structure with a conditional clause and main action, suitable for learning span segmentation in English text."}}
{"raw": "Although formulas 7 and 8 are not equivalent, they are not independent. The former is validly deducible from the latter.", "type": "natural", "id": {"id": "83f008d6-ae09-44b8-a226-a808dc2aac92"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.8, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear sentences with identifiable phrases; useful for learning sentence boundaries and logical relationships in text. / Clear sentences with logical structure; spans can be identified as individual phrases or clauses for training purposes. / Clear sentence structure with identifiable spans; useful for learning span composition in English text. / Clear sentence structure with identifiable spans (\"formulas\", \"7 and 8\", etc.) that can be used to learn span segmentation in English text. / Clear sentence structure with identifiable spans; useful for learning context and relationships in text."}}
{"raw": "A very strong kind of completeness is possessed by a system all of whose well formed formulas are provable as theorems But this kind of completeness amounts t0 inconsisteney, and is of course undesirable. Our first", "type": "natural", "id": {"id": "fff193af-b2ad-46e8-9481-d6210aa61dd8"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear prose with identifiable phrases and sentences, though somewhat complex; represents valuable patterns for learning span segmentation in a purely linguistic context. / Clear prose with identifiable phrases and sentences, though slightly informal language may affect clarity for some models. Well-suited to learning span composition in a natural context. / Clear prose with identifiable phrases and sentences, though somewhat fragmented; useful for learning sentence boundaries in NLP tasks. / Clear sentence structure with identifiable phrases and concepts, suitable for learning span segmentation in a language context. / Clear prose with identifiable phrases, though slightly complex sentence structure may challenge span segmentation learning."}}
{"raw": "When it is kept in mind that the horseshoe symbol is a truth-functional connective that stands for material implieation rather than either 'implication in general\" O1 more  usual kinds of implications such as logicalor causal, then the tautologous statement forms in question are not atall surprising: And when the misleading English formulations are corrected by inserting the word 'materially' before 'implied' and 'implies' then the air of paradox vanishes", "type": "natural", "id": {"id": "2ebd2470-4d58-4888-a028-7b95500a85c4"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear prose with identifiable phrases; useful for learning sentence structure and logical connectors in English text. / Clear prose with identifiable logical structures and meaningful spans; useful for learning sentence-level span segmentation in NLP tasks. / Clear prose with identifiable phrases and logical structure suitable for learning span segmentation in a tokenizer-free context. / The segment contains clear linguistic structures and logical expressions that can be segmented into meaningful spans, such as phrases denoting implications (\"material implication\") or corrections to misleading formulations (inserting \"materially\"). It is clean for training purposes but may lack direct relevance due to its abstract nature. / Clear sentence structure with identifiable spans; useful for learning language patterns and logical connectors in English text."}}
{"raw": "Material implication is a special, technical concept that the logician introduces and uses because it simplifies his task of diseriminating valid from invalid arguments: Two statements are saicl to be materially equivalent when they have the same truth value, and we symbolize the statement that they are materially equivalent by inserting the symbol between them.", "type": "natural", "id": {"id": "45b01684-0117-4e0a-8270-033491acf4e9"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear sentence structure with identifiable spans like \"Material implication,\" \"logician introduces and uses,\" etc., representing valuable patterns for learning span segmentation in English text. / Clear prose with identifiable technical terms and logical structure suitable for learning span segmentation in a tokenizer-free context. / Clear, coherent prose with identifiable technical concepts and logical structure suitable for learning span segmentation in a tokenizer-free context. / Clear, coherent prose with identifiable technical concepts suitable for learning span segmentation in a tokenizer-free context. / Clear prose with identifiable spans for logical concepts and terminology, suitable for learning span composition in a linguistic context."}}
{"raw": "Any attribute that can be truly predicated of itself will be said to be a predicable attribute. Thus being preclicable is an attrilute that belongs to all those and only those attributes that can be truly predicated of themselves.", "type": "natural", "id": {"id": "73b16471-2388-48ac-ae22-0e552fb9b506"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear sentence structure with identifiable phrases and concepts for span segmentation; coherent content representative of complex linguistic patterns. / Clear sentence structure with identifiable phrases; useful for learning span segmentation in complex sentences. / Clear, coherent prose with identifiable meaningful spans; well-suited for learning span composition in a tokenizer-free context. / Clear sentence structure with identifiable spans; useful for learning complex linguistic patterns. / Clear sentence structure with identifiable phrases; useful for learning span composition in English prose."}}
{"raw": "The preceding formulation of the ramified theory of logical types is crude, but it suffices to eliminate the Grelling paradox: In Case 1, the step from 2 to 3 is rejected on the grounds that the function 'Het' is of higher order than the function variable V and may not be instantiated in its place.", "type": "mixed", "id": {"id": "3b2572aa-5411-452a-8826-46045a2a9d5c"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.72, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "The text segment contains a mix of formal logical language and mathematical notation, which can help the model learn span segmentation for both types of content. However, it lacks clear delimiters between spans that could be problematic in training data preparation. / The segment contains a mix of formal language and logical expressions, which could be useful for learning span segmentation in both textual content (natural) with embedded technical terms or phrases that resemble programming logic constructs (\"code\"). However, the clarity is somewhat compromised due to its abstract nature. / Clear logical structure with identifiable spans; useful for learning complex sentence composition and nested expressions in NLP. / The text contains a mix of formal language and logical expressions, which can be segmented into meaningful spans such as \"ramified theory,\" \"logical types,\" etc., representing valuable patterns for learning span composition in both natural language processing (NLP) contexts like this one. / Contains a mix of formal language and logical expressions, with clear structured elements suitable for span segmentation in both domains."}}
{"raw": "Being a truth-functional connective, the three-har symbol is defined by the following truth table:\nq p = q 1 1 1", "type": "mixed", "id": {"id": "3b96faf9-9958-4265-bc9b-02ee23305a64"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.8, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "The segment combines both a truth-functional connective explanation (natural language) and its representation in symbolic logic, which is useful for learning span segmentation across different content types. / The segment contains a clear truth table with logical values, which can be segmented into meaningful spans for learning purposes; it combines both symbolic representation (code) and explanatory text (natural language). / The text segment contains a clear definition of the three-har symbol with its truth table, which is structurally sound and represents valuable patterns for learning span composition in both mathematical notation (code-like) and natural language explanation (\"truth-functional connective\"). / The segment combines both a declarative statement (natural language) and the representation of truth table values for logical connectives, which can help in learning span segmentation across different content types. / The segment contains a clear truth table with logical values, which can be segmented into meaningful spans for learning purposes; it combines both symbolic logic (code-like) and explanatory text in natural language effectively."}}
{"raw": "In Case 2, the step from 1 to 2 is likewise rejected on the grounds that the function 'Het' is ofhigher order than the function variable '$' and may not be instantiated in its place.", "type": "mixed", "id": {"id": "29e2c94a-a0ef-4faf-a18d-67f852b09d8b"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.8, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "The segment contains a mix of programming concepts (functions, variables) and formal language that can be segmented into meaningful spans for learning purposes; it is clean but lacks context which might affect its utility as standalone training data. / Contains both programming language syntax and mathematical notation, which can help the model learn span segmentation in a context that includes variable names ('$'), function calls ('Het()'), logical operators (like 'is higher order than' implying comparison), and natural language expressions (\"Case 2\", \"step from 1 to 2\"). / Contains both programming concepts and language, with clear spanable elements like function names, variables, logical constructs (\"Case\", \"function variable\"). Well-formed for training purposes in a tokenizer-free context. / The segment contains a mixture of programming concepts (function, variable) and legal text structure (\"Case\", \"step\"). It presents clear patterns for learning span segmentation in both contexts. / The segment contains a mixture of programming terminology and mathematical expressions, with clear delineation between the function 'Het' (presumably in LaTeX or similar notation) as an expression that cannot be instantiated due to its higher order compared to variable '$'. This provides valuable patterns for learning span segmentation across different domains."}}
{"raw": "If we now ask whether the attribute of being impredicable can be truly predicated of itself or not; we are led to the following unhappy conclusion: If", "type": "natural", "id": {"id": "6151c4ed-f75e-4efc-aa8f-f0152efec88b"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.8, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear, coherent prose with identifiable sentence structure suitable for training a span-aware model on English text. / Clear sentence structure with a complex idea that can be segmented into meaningful spans; clean and coherent for training purposes, representing valuable patterns in span composition within the context of philosophical discourse. / Clear sentence structure with identifiable spans; well-suited for learning span segmentation in English prose. / Clear sentence structure with a complex, predicative nature that can be segmented into meaningful spans for learning purposes. / Clear sentence structure with a complex idea that can be segmented into meaningful spans for learning purposes."}}
{"raw": "Another feature of the ramified theory of logical types is that it divides propositions into a hierarchy of propositions of different orders Just as any function (of any type) is a first-order function if it makes no reference to any totality of functions of that type (i.e,, if it contains no quantifier on any function variable of that type), so any proposition is said to bea first-order proposition if it makes no reference to any totality of propositions (i.e,, if it contains no quantifier on any", "type": "natural", "id": {"id": "ae8a775f-7dba-4a8d-9ce9-e8ee9007c24c"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.74, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear hierarchical structure with meaningful spans; well-suited for learning span segmentation in complex sentences. / The text segment contains clear hierarchical structures and logical constructs that can be segmented into meaningful spans, representing valuable patterns for learning span composition in a tokenizer-free context. It is clean but lacks contextual coherence due to the abrupt ending; however, it retains its educational value on theoretical concepts related to logic types which are relevant as natural language content. / Clear hierarchical structure with meaningful spans; well-suited for learning span composition in propositional logic context. / Clear hierarchical structure with meaningful spans; well-suited for learning span segmentation in complex sentences. / Clear hierarchical structure with meaningful spans; well-suited for learning span composition in logical propositions."}}
{"raw": "Sec. 2.2]\nConditional Statements 17\nwith a true antecedent and a false   consequent must be false.", "type": "mixed", "id": {"id": "060b2984-83b3-4d26-b5ce-8be7c76b1d0b"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "The segment contains a mixture of structured elements (section headers, numbers) and language that could be useful for learning span segmentation in both programming contexts (\"Sec.\" as section marker or variable name; \"17\" possibly denoting an identifier like line number). / The segment contains a mixture of structured text (section headers, numbers) and programming-like expressions (\"true antecedent\", \"false consequent\"). This combination can help the model learn span segmentation in both natural language contexts with code constructs. However, it lacks clarity due to unconventional use of punctuation which may confuse tokenization processes; thus not fully ideal but still valuable for mixed content training. / The segment contains a mixture of structured elements (section labels, numerical references) and plain text that can be segmented into meaningful spans for training purposes. It represents valuable patterns in both natural language processing with technical terms (\"true antecedent\", \"false consequent\") as well as code-like structures (\"Sec.\", \"[...]\"). / The segment contains a mix of structured text (section headers, numerical references) and programming-like expressions (\"with a true antecedent... must be false\"), which can help the model learn span segmentation in both natural language contexts with technical terms as well as code constructs. / The segment contains a mixture of structured text (section headers, numbers) and programming-like expressions (\"true antecedent\", \"false consequent\"). It has clear delimiters that can be used to identify spans for training purposes in both natural language processing tasks related to code documentation or comments."}}
{"raw": "Therefore, if anyone is a temperamental genius, then all great composers are temperamental.", "type": "natural", "id": {"id": "2dca9eea-a5fb-4a3e-8e21-e859928ba00a"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.74, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear sentence structure with identifiable subject-predicate-object spans; well-suited for learning compositional patterns in language. / Clear sentence structure with identifiable spans; useful for learning compositional patterns in language. / Clear sentence structure with identifiable spans; useful for learning compositional patterns in language. / Clear, coherent sentence with identifiable subject-predicate-object structure suitable for learning span segmentation in a tokenizer-free context. / Clear sentence structure with a logical flow; spans can be identified as phrases and clauses, representing valuable patterns for learning span composition in the context of language understanding."}}
{"raw": "cardinal numbers, that card A = card B if and only if A ~ B. It should be realized that powers and products of ordinals must not be interpreted cardinally.", "type": "natural", "id": {"id": "88c86fe8-6c7a-4f0c-a207-50ec061a704e"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "The text segment contains clear logical statements and mathematical expressions that can be segmented into meaningful spans, such as \"cardinal numbers,\" \"powers and products of ordinals.\" It is clean for training purposes but may lack context or examples to fully represent the domain's complexity. / The text segment contains clear mathematical expressions and logical statements that can be segmented into meaningful spans, such as \"cardinal numbers,\" \"A = card B,\" etc., which are useful for learning span composition in a tokenizer-free context. / Clear sentence structure with identifiable spans; useful for learning span segmentation in English prose. / Clear sentence structure with identifiable phrases; useful for learning span composition in mathematical expressions and logical statements. / The text segment contains clear logical expressions and mathematical notations that can be segmented into meaningful spans, representing valuable patterns for learning span composition in the context of formal logic or mathematics-related language processing tasks. It is clean but lacks contextual coherence as a standalone sentence; however, it could serve well when paired with additional examples to improve its utility further."}}
{"raw": "= [p v (q*9)]\nwhich permits us to interchange p and pv (q*4) wherever either of them occurs. It is clear that by invoking the defining equivalences\n(p 5 4) = (pv 4) and (p= 9) = [(p:q) v (p-q)]", "type": "mixed", "id": {"id": "333ba809-b2d9-4caf-9866-e0deff3c525d"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.72, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "The segment contains a mix of symbolic expressions and logical equivalences, which can be segmented into meaningful spans for learning purposes; it is coherent but lacks context that could improve its utility as training data. / The segment contains both mathematical expressions and logical equivalences, which can be segmented into meaningful spans for a span-aware model to learn from the patterns of variable substitution in equations. / The segment contains a mix of mathematical expressions and logical equivalences that can be segmented into meaningful spans, representing valuable patterns for learning span composition in both symbolic logic and programming contexts. It is clean but lacks natural language context which may limit its utility as standalone training data; however, it could benefit from additional examples to improve coherence across domains. / The segment contains both mathematical expressions and logical equivalences, which can be segmented into meaningful spans for a span-aware model to learn from. It is clean but lacks context that could improve its utility as training data. / The segment contains a mix of symbolic expressions and logical equivalences, which can be segmented into meaningful spans for learning purposes; however, it lacks clarity in its current form due to the presence of symbols that may not directly correspond with natural language or standard code constructs."}}
{"raw": "To avoid errors like these, We must obey the indicated restric- tions in using UG . 3. Existential Generalization (Preliminary Version). Because the existential quantification of a propositional function is true if and only if that proposi- tional function has at least one true substitution instance, we can add to our list of Rules of Inference the principle that the existential quantification of a propositional function can validly be inferred from any substitution instance of that propositional function.", "type": "natural", "id": {"id": "0a0063e6-54ba-402b-8c6e-eddeb22617d8"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.76, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear, coherent prose with identifiable meaningful spans; useful for learning span segmentation in English text. / Clear, coherent prose with identifiable meaningful spans; useful for learning sentence structure and logical expressions in text. / Clear sentence structure with identifiable spans; useful for learning span segmentation in English prose. / Clear structure with identifiable spans; useful for learning patterns in logical expressions and formal language. / Clear, coherent prose with identifiable meaningful spans like \"restrictions,\" \"existential quantification,\" and logical constructs suitable for training a span-aware model in the context of formal logic or philosophical texts."}}
{"raw": "is easily shown that any class can be designated by infinitely many different class-expressions.", "type": "natural", "id": {"id": "bb0358c2-01bf-4aff-af43-31ebd0cde93b"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.8, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear, coherent sentence with identifiable spans of words and phrases suitable for learning span segmentation in a tokenizer-free context. / Clear, coherent sentence with identifiable phrases and words suitable for learning span segmentation in a purely linguistic context. / Clear, coherent sentence with identifiable phrases suitable for learning span composition in a tokenizer-free context. / Clear, coherent sentence with identifiable spans; good for learning span composition in English prose. / Clear, coherent sentence with identifiable spans; useful for learning span composition in English text."}}
{"raw": "variables or their negations. Thus the expression (1) (p v q) (r v $) in which the conjunction symbol occurs between disjunctions, reduces by repeated applications of the principles of Distribution; Commutation, and Association into (2) (par) v (q*r) v (p\"s) v (q*s) in which conjunction symbols connect single variables only.", "type": "mixed", "id": {"id": "d2f97a64-6efe-4a3b-a78a-030ded0d898e"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "The text segment contains a mixture of logical expressions and mathematical notation, which can be segmented into meaningful spans like variables (p, q), operators (& symbol for conjunction/conjunction symbols connecting single variables only). It is clean but lacks context to fully understand the domain-specific patterns. / The segment contains a mixture of logical expressions and variable names, demonstrating clear span segmentation between variables (p, q), operators (& symbol for conjunction/disjunction) and parentheses which are essential patterns to learn in both natural language processing tasks involving code-like structures as well as formal logic. / The segment contains a mixture of symbolic expressions and logical notation, which can be segmented into meaningful spans for learning span segmentation in both mathematical logic contexts (code-like) and linguistic structures (natural language). Despite some ambiguity with symbols like \"$\", it still represents valuable patterns. / The text contains a mixture of logical expressions and variable names, which can be segmented into meaningful spans for learning span composition in both programming logic (code) context as well as symbolic reasoning within natural language explanations. However, the notation is somewhat unconventional with symbols like \"$\" instead of typical variables or operators; this could pose challenges but still offers valuable patterns to learn from. / The text segment contains a mixture of logical expressions and variable names, which can be segmented into meaningful spans for learning purposes; however, it lacks clarity due to the presence of symbols that are not clearly explained or defined in this context."}}
{"raw": "that propositional function will yield a true substitution instance of it. Of course, we may not know anything else about that individual.", "type": "natural", "id": {"id": "144f8933-856c-43af-a2a0-6df88906e232"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "The text segment is coherent and contains clear linguistic structures that can be segmented into meaningful spans, such as \"propositional function,\" \"true substitution instance,\" etc., which are valuable for learning span composition in a tokenizer-free context. / Clear sentence structure with meaningful spans; good for learning span composition in English text. / The text segment contains clear linguistic structures and phrases that can be segmented into meaningful spans, such as \"propositional function,\" \"true substitution instance,\" etc., which are valuable for learning span composition in a tokenizer-free context. It is coherent but lacks domain-specific patterns typical of code or mixed content types; however, it remains clean enough to serve its purpose effectively within the natural language category. / The text segment contains clear linguistic structures and can be segmented into meaningful spans such as \"propositional function,\" \"true substitution instance,\" etc., which are valuable for learning span composition in a tokenizer-free, span-aware model focused on processing natural language texts. / Clear sentence structure with potential for identifying subject-predicate-object spans; coherent and representative of English prose."}}
{"raw": "74 Quantification Theory [Ch:\nBut we can take any individual constant other than `y say , W which has had 20 prior occurrence in that context and use it to denote the individual or one of the individuals whose existence has been asserted by the existential quantifica - tion.", "type": "natural", "id": {"id": "db2fc39f-e204-4ce9-9b32-0fc50e82d748"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear sentence structure with identifiable spans; useful for learning context and quantification expressions in NLP. / Clear sentence structure with identifiable spans; useful for learning context and quantification expressions in English text. / Clear sentence structure with identifiable spans; useful for learning context and quantification expressions in English text. / Clear sentence structure with identifiable spans like \"Quantification Theory\", \"[Ch:\", and phrases denoting mathematical concepts, suitable for learning span segmentation in a purely linguistic context. / Clear sentence structure with identifiable spans; useful for learning context and quantification expressions in English text."}}
{"raw": "The first example, 'Everything is mortal' can alternatively be ex- pressed as Given any individual thing whatever , it is mortal.", "type": "natural", "id": {"id": "3503302c-731d-4dae-a667-72fd609e7600"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.76, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear sentence structure with identifiable spans; useful for learning span composition in English prose. / Clear sentence structure with identifiable spans; useful for learning phrase segmentation in English text. / Clear sentence structure with identifiable spans; useful for learning phrase segmentation in English prose. / Clear sentence structure with potential for learning phrase spans; well-written prose suitable as training data. / Clear sentence structure with potential for learning phrase segmentation; coherent and representative of English prose."}}
{"raw": "Line 5 is the result of applying the Nicod Rule to lines 3 and 4 Line 6 is Theorem 6 with S /Q.|.U in place of P with U.|.S|Q in place of and of R, and with Q/S. |.U:|:QlS.|.U in place of S. Line 7 is Theorem 3 with S/Q in place of S and with U in place of P Line 8 is the result of applying the Nicod Rule to lines 6 and 7. Line 9 is the result of applying the Nicod Rule to lines 5 and 8.", "type": "code", "id": {"id": "3fad72d3-e78d-45fe-8a04-a37e1127b6ad"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear structured patterns with identifiable spans, representing valuable learning for span segmentation in programming contexts. / Clear structure with identifiable spans; represents valuable patterns for learning span composition in programming context. / Clear structured patterns with identifiable spans; represents valuable learning for span segmentation in programming context. / The segment contains structured patterns of theorem statements and Nicod Rule applications, which are valuable for learning span segmentation in a mix of mathematical notation (code-like) with explanatory text (natural language). However, the clarity could be improved by separating lines or adding context to enhance training utility. / The segment contains structured patterns of theorem references and transformations that can be segmented into meaningful spans, useful for learning span composition in a tokenizer-free context. It combines both mathematical notation (code-like) with explanatory text (natural language). However, it lacks clarity due to the absence of punctuation or clear separation between lines; thus some ambiguity is introduced which slightly reduces its score from 1.0."}}
{"raw": "We can use the individual variable X in place of the pronoun it and its antecedent to paraphrase the first general proposition as Given any 1, x is mortal.", "type": "natural", "id": {"id": "b638a774-952e-457d-a115-5da479d0bc52"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear sentence structure with identifiable spans; paraphrasing example useful for learning context and variable usage in text. / The text lacks clear, identifiable spans for meaningful segmentation; it is not well-suited as training data due to poor clarity and coherence. / Clear sentence structure with identifiable spans; paraphrasing and logical connectors present valuable patterns for learning span composition in a natural language context. / Clear sentence structure with identifiable spans; paraphrasing example useful for learning context and variable usage in text. / Clear sentence structure with identifiable spans for paraphrasing and variable substitution, useful in learning span segmentation from context clues."}}
{"raw": "Then we can use the notation already introduced to rewrite it as\nGiven any 1, Mx:\n1 Some logicians enclose the individual constant in parentheses, symbolizing 'Socrates is human` as 'H(s) , but we shall not follow that practice here. 2Some writers have defned 'propositional functions' to be the meanings of such expressions; but here Ie define them as the expressions themselves.", "type": "natural", "id": {"id": "86301780-e1b3-448a-9b77-028baa1cae4a"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "The segment contains clear sentence structures and introduces concepts that can be segmented into meaningful spans, such as \"individual constant,\" \"propositional functions.\" It is clean but lacks coherence due to the abrupt ending (\"but we shall not follow that practice here\"). / Clear sentence structure with identifiable spans; useful for learning span segmentation in prose. / Clear sentence structure with identifiable spans; useful for learning span segmentation in prose. / Clear sentence structure with identifiable spans; useful for learning phrase segmentation in English prose. / Clear sentence structure with identifiable spans; useful for learning span segmentation in prose."}}
{"raw": "|.PIS in place of and of R, and with QIS:|:P S: |.P|S:. I:Q S: |: P|S. | PlS in place of S Line 2 is Theorem 6. Line 3 is the result of applying the Nicod Rule to lines 1 and 2.", "type": "mixed", "id": {"id": "858fcd33-67cb-43ee-b884-c2243de89628"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.76, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "The segment contains a mix of mathematical notation and structured text, which can be segmented into meaningful spans representing both equations (PIS) and theorem statements (\"Theorem 6\"). It is clean but lacks context for full comprehension without domain knowledge in mathematics or formal logic. / The segment contains a mix of structured elements (lines, theorems) and mathematical notation that can be segmented into meaningful spans for learning purposes. It is clean but lacks context which may affect its utility as training data. / The segment contains a mix of structured elements (lines, theorems) and formal notations that can be segmented into meaningful spans for training purposes. It is clean but lacks context which might affect its utility in isolation. / The segment contains a mix of programming notation and mathematical expressions, with clear delimiters for spans like \"Line X\" or theorems that can be segmented meaningfully; it is coherent but lacks context which may affect its utility as training data. / The segment contains a mix of programming notation and mathematical expressions, which are structurally clear for span segmentation; however, it lacks coherence as an isolated example due to its fragmented nature. It represents valuable patterns in both code syntax (e.g., \"PlS\") and natural language descriptions (\"Theorem 6\"), but the context is missing or unclear without additional surrounding text."}}
{"raw": "The four 'Principles of Identity' stated in Section 5.4 can be established here as derived rules of inference.", "type": "natural", "id": {"id": "3e4870a6-b52a-4152-b815-099823f5ddde"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.78, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear sentence structure with identifiable phrases and concepts suitable for learning span composition in a tokenizer-free context. / Clear and coherent prose with identifiable phrases suitable for learning span segmentation in a natural language context. / Clear sentence structure with identifiable phrases; useful for learning span composition in English text. / Clear, coherent sentence with identifiable phrases and concepts suitable for learning span segmentation in a tokenizer-free context. / Clear sentence structure with identifiable phrases; useful for learning span segmentation in English prose."}}
{"raw": "Sec. 4.1] Singular Propositions and General Propositions 65 The phrase Given any x' is called a universal quantifier' and is symbolized by \"(x)' . Using this new svmbol, We can completely symbolize our first general proposition as\n()Mx\nWe can, similarly, paraphrase the second general proposition; 'Something is mortal successively as\nThere is at least one thing that is mortal. There is at least one thing such that it is mortal. There is at least one x\" such that x is mortal.", "type": "mixed", "id": {"id": "a3906864-c961-40c3-be67-cb8740de7fb9"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "The segment contains a mix of formal language and symbolic notation, which can be useful for learning span segmentation in both domains; however, it lacks clarity due to the presence of symbols without context or explanation. / The segment contains a mixture of formal language and symbolic expressions, which can help the model learn span segmentation in both structured (code-like) constructs as well as more fluid text segments typical for natural languages. However, it lacks clarity due to symbols like \"(x)\" that are not standard notation; this could confuse learners if they don't have context clues or prior knowledge about these specific symbolic representations. / The segment contains a mix of formal language and symbolic notation, which can help the model learn span segmentation for both linguistic constructs (natural) and mathematical expressions or symbols used in logical propositions ((x)'). However, it is somewhat complex due to its abstract nature; thus not all spans are immediately clear. / The segment contains a mixture of formal language and symbolic notation, which can help the model learn span segmentation in both contexts; however, it lacks clarity due to unconventional formatting (e.g., missing spaces around symbols). / The segment combines formal language with symbolic notation, providing clear examples of span segmentation between phrases and symbols that can be useful for learning patterns in both domains. However, it may require additional context to fully understand the meaning behind some notations like \"(x)\"."}}
{"raw": "The Hilbert-Ackermann System 261 which on their normal interpretations express noncompound propositions; and has in addition to parentheses, the two operator symhols and V (desig- nated in our metalanguage by and v\"), which have as their normal interpretations the operations of negation and weak (or inelusive) disjunetion. We continue to use the symbols P', 0, ~R` S' with and without subscripts, in our metalanguage, to denote well formed formulas of H.A. (the Hilbert-Ackermann system of logic).", "type": "mixed", "id": {"id": "b32d105b-d064-45a7-970f-54446dc0abdc"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.76, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear structure with identifiable spans (e.g., \"Hilbert-Ackermann System\", \"negation and weak disjunction\"). Well-formed for training purposes, though somewhat complex due to domain-specific terminology which is valuable in learning span composition within logical expressions or mathematical contexts. / The segment contains a mix of formal logic notation and descriptive text, with clear structures for both logical expressions (e.g., \"P'\", \"~R`\") and explanatory phrases (\"desig- nated in our metalanguage by\"). It is coherent but may require additional context to fully understand the domain-specific references. / Clear structure with identifiable spans like \"Hilbert-Ackermann System\", logical symbols, and well-defined terms; clean for learning patterns in span segmentation of complex sentences. / The segment contains a mix of formal logic notation and descriptive text, with clear structure for span segmentation (e.g., symbols like P', 0, ~R`, S' can be identified as spans). It is clean but may require domain-specific knowledge to fully understand. / The segment contains a mixture of formal logic notation and descriptive text, with clear syntactic structures that can be segmented into meaningful spans for training purposes. It is coherent but may require domain-specific knowledge to fully understand the context (formal logical systems)."}}
{"raw": "Line 4 is Theorem 7 with P |S. |.P|S in place of U. Line 5 is the result of applying the Nicod Rule to lines 3 and 4\nT H E 0 R E M 9 _\nS:. |:P.A.SIS: |:P.E.SIS\nProof: Line 1 is Theorem 3 with S/S. |.P in place of S, and with P. |.S S: I;P.A.SIS in place of P Line 2 is Theorem 1 with S/S in place of S. Line 3 is the result of applying the Nicod Rule to lines L and 2 Line 4 is the Nicod Axiom with P. |.S|S: |:P. |.S|S in place of P, with S/S in place of Q, and with P", "type": "mixed", "id": {"id": "58e6d53c-3e3b-4d2a-8201-18439365f3f3"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "The segment contains a mix of theorem references and symbolic expressions, but lacks clear sentence structure for effective span segmentation training; it's too specialized with unclear context. / The segment contains a mix of theorem statements and proof steps, with clear references to lines (spans) that can be used for learning span segmentation in both mathematical notation and structured text formats. However, the presence of natural language descriptions alongside formal expressions may require additional context or preprocessing before being fully effective as training data. / The segment contains a mixture of theorem references and proof steps, with clear structure for span segmentation; however, it lacks context which might be necessary to fully understand the content's purpose in training. / The segment contains a mix of theorem references and formal logic expressions, which can be segmented into meaningful spans for learning purposes; however, it may require additional context or preprocessing to fully benefit X-Spanformer training due to its specialized nature. / The segment contains a mix of theorem references and logical rules, with clear structured elements like \"Theorem X\", line numbers, and rule applications that can be segmented into meaningful spans for training purposes. However, the presence of symbols may require additional preprocessing to ensure clean data input."}}
{"raw": "The notion of a wff of H.A. is defined recursively as follows:\nRECURSIVE RULE FOR wffs IN H.A.\n1\nAny single letter of H.A. is a wff: 2 If P is & wff , then (P) is a wff: 3. If P and are wffs, then (P) v (Q) is a wff: (No formula of H.A will be regarded as being a wff unless its being so follows from this definition.)", "type": "mixed", "id": {"id": "1089d95f-9115-4b4d-b2bf-332af8ffe3b7"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.8, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear recursive rules for wffs with identifiable spans; clean and coherent structure suitable across domains. / Clear recursive rules and structured definitions for wffs; spans identified as single letters, phrases like \"(P)\", \"v (Q)\" are meaningful patterns in H.A.'s formal language context. Well-formed content with logical progression suitable across both natural languages' syntax understanding and programming constructs parsing. / Clear recursive rules for wffs; well-defined structure suitable for learning span segmentation in programming context. / Clear recursive rules and structured definitions for wffs; spans can be identified as individual elements (letters, parentheses). Well-formed content with valuable patterns for learning span composition in both natural language explanations of code constructs. / Clear recursive rules for wffs; well-defined structure suitable for learning span segmentation in programming context."}}
{"raw": "instances are true. Also, the existential quantification of a propo- sitional funetion is true if and only if it has at least one true substitution instance: If we grant that there is at least one individual, then every proposi- tional funetion has at least one substitution instance (true or false).", "type": "natural", "id": {"id": "7b2a3f12-3ebf-42d6-a0bb-0e44f88c1ed1"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "The text segment is coherent and contains complex structures such as logical statements, which can be segmented into meaningful spans for learning purposes in a span-aware model focused on natural language processing tasks. / Clear sentences with logical structure, suitable for learning span segmentation in complex statements. / Clear sentence structure with identifiable spans; useful for learning span segmentation in prose. / The text segment contains clear logical statements and structured arguments that can be segmented into meaningful spans for learning span composition in a tokenizer-free context, though it lacks explicit programming or markup language elements typical of code content. It is coherent but may require additional domain-specific examples to fully represent the target domains like formal logic expressions within natural language contexts. / Clear sentences with logical structure, suitable for learning span segmentation in English prose."}}
{"raw": "does not require that u and v be different variables; they may well he the same. On the whole, it is Simpler", "type": "natural", "id": {"id": "332ceba2-4245-439b-9f3f-91581be8b145"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear sentence structure with identifiable spans; useful for learning span segmentation in English prose. / Clear sentence structure with identifiable spans; useful for learning context and variable usage in text. / Clear sentence structure with identifiable spans; useful for learning context and variable usage in NLP tasks. / Clear sentence structure with identifiable spans; useful for learning span segmentation in English prose. / Clear sentence structure with identifiable spans; useful for learning context and variable usage in text."}}
{"raw": "Then we must prove that all of these, or all their substitution instances, can be expressed in our object language R.S. also, in its normal or standard interpretation. Such & method of expressing all possible truth fune- tions is provided by truth tables , which were introduced in Chapter 2 The method and notation of truth tables is, therefore, imported into our semantieal metalanguage, and will be used freely in ciscussing the various semantical properties possessed bv R.S. on its standard interpretation:", "type": "mixed", "id": {"id": "675a8c33-efb3-4ee5-82b9-7a74ca4927cc"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "The segment contains a mix of formal language and mathematical notation, which can be segmented into meaningful spans such as \"object language R.S.\", \"truth tables\", etc., representing valuable patterns for learning span composition in both natural language processing (NLP) tasks related to code understanding or technical documentation. / The segment contains structured arguments and logical expressions that can be segmented into meaningful spans, such as phrases denoting mathematical concepts (\"truth functions\", \"semantical properties\") or references to previous chapters (e.g., Chapter 2). It is clean for training purposes but may lack context-specific patterns due to its abstract nature. / The segment contains a mix of formal language and mathematical notation, which can be segmented into meaningful spans such as phrases (\"prove that all\", \"expressed in our object language R.S.\", etc.). It is coherent but may require domain-specific knowledge to fully understand the context. / The text segment is coherent and contains structured elements like phrases, sentences that can be segmented into meaningful spans for learning purposes; however, it lacks clear delimiters which are essential in training a tokenizer-free model to understand span boundaries effectively. / The text contains a mix of formal language and mathematical expressions, which can help the model learn span segmentation in both domains; however, it lacks clarity due to unconventional symbols like \"&\" instead of \"and.\" Clean-up is recommended for better training utility."}}
{"raw": "Sec. 8.6]\nDeductive Completeness 253\nF [(Pi v Pz v . . . V P;) v P+]R = (P1 V Pz V _ VB)R v Pk+lR Th. 30, Cor. F", "type": "mixed", "id": {"id": "8c54ab17-968b-4ade-a151-15a4b431d8a5"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Contains both structured elements (section headers, mathematical expressions) and spans that can be segmented meaningfully for learning purposes. / The segment contains a mix of mathematical notation and structured text, which can help the model learn span segmentation in both domains. However, it lacks clarity due to formatting issues like missing spaces around symbols (e.g., \"F\" instead of \"f\"). / The segment contains a mix of mathematical notation and formal language, which can be segmented into meaningful spans such as \"Sec.\", \"[\", \"]\", identifiers like \"(Pi v Pz)\", function symbols (\"F\"), logical operators (v), variables (\"P+R\", etc.), constants (\"Th. 30, Cor.\"), suggesting clear structural patterns for learning span segmentation in mixed content types. / The segment contains a mix of mathematical notation and structured text, which can help the model learn to distinguish between different types of spans in both domains. However, it lacks clarity due to potential typographical errors (\"Sec.\" instead of \"Section\" or similar) and unclear variable names like \"(Pi v Pz).\" / The segment contains a mix of mathematical notation and structured text, which can be segmented into meaningful spans for learning purposes; however, the presence of symbols like \"Sec.\", \"[\", \"]\" may require additional preprocessing or context understanding by X-Spanformer."}}
{"raw": "That is, direct observation will suffice to decide, of every line beyond the premisses, whether or not it actually does follow from preceding lines by one of the given Rules of Inference.", "type": "natural", "id": {"id": "f54d3188-3928-4773-bdc4-93b7517d7e19"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.8, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear, coherent sentence with identifiable spans for training; well-suited to demonstrate span segmentation in contextually rich text. / Clear, coherent prose with identifiable logical structure suitable for learning span segmentation in a tokenizer-free context. / Clear, coherent prose with identifiable logical structure suitable for span segmentation and learning patterns in inference rules. / Clear, coherent prose with identifiable logical structure suitable for learning span composition in a tokenizer-free context. / Clear, coherent prose with identifiable logical structure suitable for training a span-aware model on complex sentence patterns."}}
{"raw": "No \"'thinking' is required: neither in thinking about what the statements mean; nor in using logical intuition to check the validity of any line $ deduction. Even where the justification' of a statement is not written beside it, there is a finite, mechanical procedure for deciding whether or not the deduction is legitimate: Each line is preceded by only a finite  number  of other  lines  and only a finite number of Rules  of Inference have been adopted.", "type": "natural", "id": {"id": "a6e48557-bac1-4c6e-8a96-97ef9332a63d"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.72, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear prose with identifiable sentence structures and logical flow, suitable for learning span segmentation in a tokenizer-free context. / Clear prose with identifiable sentences and phrases; good for learning span segmentation in a language context. / Clear prose with identifiable sentences and logical structure, suitable for learning span segmentation in a tokenizer-free context. / Clear prose with identifiable logical structure and finite elements suitable for span segmentation. / Clear, coherent prose with identifiable sentence structures and logical flow suitable for learning span segmentation in a tokenizer-free context."}}
{"raw": "Sec. 4.2]\nProving Validity: Preliminary Quantification Rules 73 the premiss must contain the special symbol *y' we might be led to construct the following proof\n1. Lc 1. . (x)Lx 2 (x)Lx 1, UG (wrong)", "type": "mixed", "id": {"id": "f4ddfe91-153f-417e-8baf-b56abbdc8eb0"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "The segment contains a mix of structured elements like section headers, mathematical expressions (proving validity), and programming logic/code constructs that can be segmented into meaningful spans for training purposes. It is clean but lacks context to fully understand the domain-specific patterns it may represent. / Contains both structured elements of a mathematical proof and programming-like notation, which can help the model learn span segmentation in diverse contexts. / The segment contains a mix of structured elements (section labels, mathematical expressions) that can be segmented into meaningful spans for training purposes. Despite some unclear parts (\"(x)Lx\" and \"UG\"), it still represents valuable patterns in span composition within both natural language descriptions and code-like constructs. / Contains a mix of structured elements (section headers, mathematical notations) and programming logic that can be segmented into meaningful spans for learning purposes. The text is clean but lacks coherence due to the abrupt transition between natural language explanation (\"Proving Validity\") and code-like expressions with incorrect syntax (\"UG\"). / The segment contains both structured elements (section headers, proof steps) and symbolic notation that can be segmented into meaningful spans for a span-aware model to learn from. It is clean but lacks coherence due to the abrupt ending (\"wrong\")."}}
{"raw": "Sec. 8.2]\nPrimitive Symbols and Well Formed Formulas 221\nthe intended or normal interpretations of ~P and PQ are given by the truth tables ~P and P Q F F T 1 ; That RS. iS adequate to express fi(P) f(P) f3(P), and f4(P) is proved by actually formulating them in R.S.", "type": "mixed", "id": {"id": "6fae36bb-0219-4d7b-b883-84a857fbe029"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Contains both structured programming concepts and mathematical expressions, providing diverse span patterns for learning. However, readability could be improved with better formatting or separation of elements. / The segment contains a mix of formal notation and prose, which can help the model learn to distinguish between different types of spans in both structured (code-like) expressions and unstructured text. However, it lacks clarity due to potential typographical errors (\"Sec.\" instead of \"Section\", etc.). / The segment contains a mix of formal notation and prose, with clear structured elements like section headers (Sec.), symbols (~P), logical expressions (PQ F F T) that can be segmented into meaningful spans for training purposes. It is clean but lacks context which might affect its utility as standalone data. / The segment contains both structured elements (like section headers and formula representations) that can be segmented into meaningful spans, representing valuable patterns for learning span composition in a tokenizer-free context. However, it lacks clarity due to the presence of symbols like \"~\" which may not have clear interpretations without additional context or explanation. / The segment contains a mix of formal notation and prose, with clear delimiters for different elements (e.g., section labels like \"Sec.\" and symbols). It has meaningful spans that can be segmented into structured parts useful for learning span composition in both natural language processing tasks."}}
{"raw": "A eriterion for deciding whether or not any wff is a tautology is supplied by the method of truth tables: Any wff $ has a truth table with as many initial columns in it as there are distinct propositional symbols in $. Where there are n of them, say P, Pv; P n > the tautology $ will have this truth table: P2 1 T\n1 :\nF\nT\nAny such truth table has 2\" rows, each of which represents a different assign - ment of Ts and F$ to the F;'s, one row for every possible assignment.", "type": "mixed", "id": {"id": "d04aa411-e4c3-4675-a396-2d52e44f47f5"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "The segment contains both structured elements (truth table format) and logical expressions, which can help the model learn span segmentation in a context that includes programming logic alongside formal language constructs. However, it lacks clarity due to formatting issues like missing spaces (\"Pv; P n >\") and unclear symbols (\"$ has a truth table with as many initial columns in it as there are distinct propositional symbols in $\"). / The segment contains a mix of formal logic notation and English text, with clear logical expressions that can be segmented into meaningful spans for learning purposes; however, the presence of both languages may pose challenges in training tokenizer-free models. / The segment contains a mix of formal logic notation and English text, with clear structures for both logical expressions (wff) and truth tables that can be segmented into meaningful spans; however, it lacks coherence due to the abrupt transition between symbols and natural language explanations. / Contains a mix of symbols and text that may confuse the model; lacks clear, isolated spans for effective learning. The presence of special characters like \"eriterion\" disrupts readability in natural language context. / The segment contains a mix of mathematical notation and English prose, with clear structured elements like truth tables that can be segmented into meaningful spans for learning purposes. However, the presence of symbols (e.g., P2) may pose challenges in tokenization-free models without further context or preprocessing steps to handle such constructs effectively."}}
{"raw": "This set looks like\n2, 4, 8, 16,\n3, 9, 27, 81,\n5, 25, 125, 625,\nand must have an even larger ordinal number.", "type": "mixed", "id": {"id": "f6301ee7-6619-4740-a878-a73aba49412c"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.74, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "The segment combines both numerical sequences and a descriptive phrase, providing diverse patterns for span segmentation in different contexts (natural language descriptions vs mathematical progression). / Clear pattern of sequences with a mix of numbers and text, representing both numerical progression (code-like) and descriptive language (\"looks like\", \"must have\"). / Contains clear numerical patterns and ordinal sequences, useful for span segmentation in both numeric context (code-like) and textual explanation (\"looks like\", \"must have\"). / The segment contains a clear pattern of sequences with an even number followed by its square, which can be segmented into meaningful spans for learning purposes. It combines numerical patterns (code-like) and descriptive text (\"looks like\", \"must have\"), making it representative of both natural language structure as well as code constructs' composition. / The text segment contains a clear pattern of sequences with an even larger ordinal number, which can be segmented into meaningful spans for learning purposes; it combines both numerical patterns and descriptive language effectively."}}
{"raw": "That only T's appear in the column under $ indicates that every possille assignment of Ts and Fs to the P;' $ must assign a T to S To show that F $ for every such S, we establish the following:\n1. Each row of its truth table, that is, each assignment of truth values to the Pi\" s, can be represented by & wff of R.S,, the first row hy Q1 the second by Qz and the last or 2\"th by Q2\"; 2. If Q1 Q2 Qz\" are the 2\" wffs representing all possible assignments of Ts and F's to the F s, then F (Q1 v Qz V V Q2\"); and 3.", "type": "mixed", "id": {"id": "d77a30a6-cd47-44dd-8a76-2eec0720b9a1"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.78, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "The segment contains a mix of mathematical notation and logical expressions, which can be segmented into meaningful spans representing variable assignments (natural language) alongside formal logic constructs that are common in programming or computational contexts. It is clean but may require additional context for full clarity due to the mixture type. / Clear logical structure with identifiable spans; useful for learning patterns in formal expressions and truth tables. / The segment contains structured, logical expressions and clear mathematical notation suitable for learning span segmentation in programming contexts. It is coherent but lacks context to fully understand the meaning of variables like 'T', 'F', 'P', etc., which may affect its utility as standalone training data without additional explanation or examples. / The segment contains a mix of mathematical notation and logical expressions, which can be segmented into meaningful spans representing different parts like variables (T's, F's), assignments ('S', 'P'), truth table representations (\"Q1\", \"Q2\"), etc., providing clear structural patterns for learning span segmentation. / The segment contains a mix of mathematical notation and logical expressions, which can be segmented into meaningful spans such as variables (T's, F's), functions ('S', 'R.S.', etc.), operators ('v'), parentheses, and numbers indicating positions in the truth table. It is clean for training purposes but may require domain-specific preprocessing to fully leverage its compositional value due to mixed content types."}}
{"raw": "included. Although the test of whether or not a given sequence of statements is a formal proof is effective, constructing such a formal proof is not an effective proceclure.", "type": "natural", "id": {"id": "90e2fbed-84e6-4330-8055-49f19bf807ca"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.72, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear sentence structure with meaningful phrases; demonstrates formal proof construction context, useful for learning span composition in NLP tasks. / Clear sentence structure with identifiable spans; useful for learning context and syntax in NLP tasks. / Clear sentence structure with identifiable phrases and terms that can be segmented into meaningful spans for training purposes. The text is clean, coherent, representing valuable patterns in language composition suitable for a tokenizer-free span-aware model like X-Spanformer. / Clear sentence structure with identifiable spans; useful for learning span segmentation in English prose. / Clear sentence structure with potential for learning punctuation and phrase boundaries in English text."}}
{"raw": "simply be expressed by specifying a function f such that f (x) = Y rather than invoking an expression like P(x, y).", "type": "natural", "id": {"id": "02e8f75d-52f5-4d23-a841-c06718df105d"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.8, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear and coherent sentence structure with a meaningful span for function definition in mathematical context. Suitable pattern representation for learning. / Clear prose with a logical structure that can be segmented into meaningful spans like \"specifying\", \"function f\", and the formula expression, representing valuable patterns for learning span composition in English text. / Clear and coherent sentence structure with a meaningful span for function definition in mathematical notation. Suitable as an example of expressing functions without invoking expressions directly, representing valuable patterns for learning span composition within the context of mathematics or programming documentation. / Clear and coherent sentence structure with a meaningful span that can be identified as an instructional statement in the context of programming or mathematical expression, representing valuable patterns for learning span composition within natural language text. / Clear and coherent sentence with a logical structure that can be segmented into meaningful spans; represents valuable patterns for learning span composition in the context of mathematical expressions or function descriptions."}}
{"raw": "254\nA Propositional Calculus [Ch: 8\nThat these will suffice to prove that + S is easily seen: Where the truth table for S has  all Ts in the   column under S, then F Q1 5 $, + Q2 3 $, F Qz\" 3 $: From these, by 2\" L uses of DR 10, we have + (Q1V Qz V _ Q2) 5 $", "type": "mixed", "id": {"id": "0ffe2e6a-ed3c-4941-ab0f-b94b7900ec08"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "The segment contains a mix of numbers, logical symbols (like + and V), variables (Q1 to Qz), which suggests clear span segmentation opportunities for both mathematical expressions in natural language context as well as programming code-like structures. / The segment contains a mix of numerical values and logical expressions, which can be segmented into meaningful spans for learning purposes; however, it lacks clarity due to the presence of symbols like \"$\" that are not standard in either natural language or programming code. / The segment contains a mixture of numerical values, logical symbols (like + and V), variable names (Q1 to Qz), which are typical in propositional calculus expressions found within both natural language explanations (\"That these will suffice...\") and code-like structures (\"From these, by 2\" L uses DR\"). It has clear structural elements that can be segmented into meaningful spans for a span-aware model. / The text segment contains a mix of numerical values, logical symbols (like + and V), variables (Q1 to Qz), which suggests clear structured patterns that can be segmented into meaningful spans for learning purposes in both natural language processing tasks related to formal logic or programming contexts. / Contains both structured elements (truth table, logical expressions) and programming-like notation that can be segmented into meaningful spans for learning purposes."}}
{"raw": "The first nine can be applied only to whole lines of a proof. Thus A can be inferred from A B by Simplification only if A B constitutes a whole line. But neither A nor A 3 C follows from (A- B) 3 Cby Simplification or by any other Rule of Inference.", "type": "natural", "id": {"id": "ab255e33-0de4-4421-aaf4-405d242f5d04"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.8, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear sentence structure with identifiable spans; useful for learning complex logical expressions in text. / Clear sentence structure with identifiable logical spans; useful for learning inference rules in language. / Clear sentence structure with identifiable logical spans; represents complex reasoning patterns useful for learning span segmentation in text. / Clear sentence structure with identifiable spans; useful for learning inference rules in logical proofs. / Clear sentence structure with identifiable logical spans; useful for learning complex reasoning patterns in text."}}
{"raw": "282 Alternative Systems and Notations [Ch. 9 The other operators can all be defined in terms of the dagger function alone: That the following definitions preserve the standard interpretations of the symbols that are being defined is easily verified by the method of truth tables:\n~P = df PVP P.Q = df PAP..Q1Q Pv Q = df PIQ.LPIQ P 3 Q = df PLP.| Q:l:PLP:L.Q", "type": "code", "id": {"id": "2681675e-6b97-4d93-b046-47d7769fc6b8"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.8, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear, structured mathematical expressions representing logical operations; well-suited for learning span segmentation in programming contexts. / Clear structured elements with consistent notation for operators, suitable for learning span segmentation in programming contexts. / Clear, structured mathematical expressions and logical notations suitable for learning span segmentation in programming contexts. / Clear, structured mathematical expressions with consistent notation suitable for learning span segmentation in programming contexts. / Clear, structured mathematical expressions and logical operators suitable for learning span segmentation in programming contexts."}}
{"raw": "Any assumption of limited scope may be made in a Conditional Proof of validity and, in particular; we are free to make an assumption of the form *$y\" Thus the argument All freshmen and sophomores are invited and will be welcome; therefore, all freshmen are invited' is proved valid by the following Conditional Proof:\n1.\n(x)[( Fxv Sx) 3 (Ix: Wx)]", "type": "mixed", "id": {"id": "3dc9f73c-95d4-4d90-a5f8-1292d08fc555"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.74, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Contains both structured logical expressions and formal proof notation, representing valuable patterns for learning span composition in a mixed context. / The segment contains a mixture of formal logic notation and English text, which presents clear structured elements that can be segmented into meaningful spans for learning purposes. It is coherent but lacks context to fully understand the argument's validity proof process in natural language alone; however, it retains valuable patterns from both code-like expressions (e.g., logical symbols) and human-readable statements (\"All freshmen...\"). / The segment contains a mix of formal logical notation and English text, which can help the model learn to identify spans in both domains; however, it lacks clarity due to improper punctuation (semicolon instead of comma) and ambiguous variable names (\"$y\"\"). / The segment contains a mix of formal logical notation and English text, with clear structured elements like premises (e.g., \"All freshmen...\"), conclusions (\"therefore, all freshmen are invited\"), and proof steps that can be segmented into meaningful spans for learning purposes. / Contains both structured logical expressions and formal proof notation, representing valuable patterns for learning span segmentation in a mix of language types."}}
{"raw": "And from the latter all the attributes of the identity relation can be deduced For the most part, our preceding discussion has concerned only attributes of things.", "type": "natural", "id": {"id": "9bd99a5b-ac69-45e0-a67c-ff1f6ba3d769"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear sentence structure with identifiable phrases and attributes; well-suited for learning span segmentation in English prose. / Clear sentence structure with identifiable phrases and attributes, suitable for learning span segmentation in a tokenizer-free context. / Clear prose with identifiable attributes and relations, suitable for learning span segmentation in a tokenizer-free context. / Clear sentence structure with identifiable phrases; useful for learning span composition in English prose. / Clear sentence structure with identifiable phrases and attributes suitable for span segmentation in a tokenizer-free context."}}
{"raw": "Sec. 5.5] Predicate Variables and Attributes of Attributes 153 the attribute of being impredicable can be truly predicated of itself, then it has the attribute of being impredicable: It follows then by definition that the attribute cannot be truly predicated of itself. On the other hand if the attribute of being impredicable cannot be truly predicated of itself, then like all other attributes that cannot be truly predicated of themselves, it has the attribute of being impredicable. This means that it can be", "type": "natural", "id": {"id": "b67df9ea-3468-42c1-ac4a-4525005ebb9f"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.72, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "The segment contains complex logical structures and nested predicates that can be segmented into meaningful spans for learning span composition in a tokenizer-free context, though it may require careful preprocessing to handle its complexity effectively. / Clear logical structure with nested statements; useful for learning complex sentence composition and span segmentation in English prose. / Clear logical structure with nested statements; useful for learning complex sentence patterns and span segmentation in English text. / The text segment contains clear logical structures and predicates that can be segmented into meaningful spans, representing valuable patterns for learning span composition in a natural language context. It is clean but somewhat complex due to its philosophical nature which may require careful handling during training. / The text segment contains complex logical structures and self-referential phrases that can be segmented into meaningful spans, representing valuable patterns for learning span composition in the context of formal logic or philosophical texts. Despite some ambiguity due to its abstract nature, it is cleanly written with clear structural elements suitable as training data."}}
{"raw": "existence of an endless series of sets with ever larger cardinality. By Zermelo $ theorem, every set is equivalent to some ordinal number:", "type": "natural", "id": {"id": "9ca09aa1-90d3-4ee2-92c7-2c9103cab661"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.8, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "The text segment contains clear mathematical and logical expressions that can be segmented into meaningful spans, such as \"existence of an endless series,\" \"$ theorem,\" etc., which are valuable for learning span composition in the context of formal language processing or mathematics-related NLP tasks. / The segment combines mathematical notation with a mix of formal language and references to set theory, which can provide valuable patterns for learning span segmentation in both domains (natural vs. symbolic). / Clear exposition of mathematical concepts with identifiable spans; well-suited for learning complex span composition in a non-code context. / Clear, coherent prose with identifiable concepts; useful for learning span composition in a theoretical context. / The text segment contains a clear reference to mathematical concepts and logical statements, which can be segmented into meaningful spans such as \"existence of an endless series,\" \"sets with ever larger cardinality,\" etc., representing valuable patterns for learning span composition in the context of formal language."}}
{"raw": "The preceding cases exhaust the possibilities, SO we have shown how to express any truth function of any number of arguments in R.S.", "type": "natural", "id": {"id": "10177b1c-f001-4fc6-be53-3148529c4749"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.76, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear, coherent sentence with identifiable phrases and logical structure suitable for learning span segmentation in a natural language context. / Clear sentence structure with identifiable phrases and terms relevant for learning span composition in NLP tasks. / Clear sentence structure with identifiable spans; useful for learning span composition in English text. / The segment contains clear, meaningful spans of English text that can be used to train a span-aware model on sentence-level structures and logical expressions in the context of programming language semantics (R.S.). It is clean but lacks contextual richness for mixed content types. / Clear sentence structure with identifiable spans like \"The preceding cases\", \"possibilities\", and the phrase \"truth function of any number of arguments in R.S.\" which can be used to train a span-aware model on English text composition."}}
{"raw": "Distribution (Dist ):\n14. Double Negation (D.N,): 15. Transposition (Trans ): 16. Material Implication (Impl): 17 .", "type": "mixed", "id": {"id": "9e581e3a-ac26-4cd3-b126-596048a301ed"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.8, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear structured elements with identifiable spans; represents valuable patterns for learning span composition in both numerical and categorical data. / Clear structured elements with identifiable spans; represents valuable patterns for learning span composition in both numerical and categorical data. / Clear structured elements with consistent formatting suitable for learning span segmentation in both numerical and textual spans. / Clear structured list of logical fallacies with identifiable spans; clean and coherent for learning patterns in span segmentation across both numbers (indices) and names (fallacy types). / Clear structured elements with identifiable spans; represents valuable patterns for learning span composition in both numerical and categorical data."}}
{"raw": "If Amherst wins its first game, then either Colgate or Dartmouth wins its first game.", "type": "natural", "id": {"id": "f72a25c6-65c2-4983-93c8-df782b01a550"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.78, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear logical structure with identifiable spans; useful for learning conditional expressions in text. / The sentence contains a conditional structure with clear, meaningful spans that represent logical relationships and can be used to learn span composition in the context of natural language processing tasks. / Clear logical structure with identifiable spans; represents valuable patterns for learning span composition in conditional statements. / The sentence contains a clear conditional structure with identifiable spans (\"Amherst wins its first game\", \"Colgate or Dartmouth wins its first game\"), which can be useful for learning span segmentation in the context of complex sentences involving logical relations and conjunctions typical to English language. / Clear conditional structure with identifiable spans; useful for learning logical constructs in text."}}
{"raw": "truly predicated of itself: We have thus been led to a contradiction.", "type": "natural", "id": {"id": "5a10075c-1d70-4f8b-b56b-dd283bdf5eb0"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.78, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear, coherent sentence with a meaningful structure suitable for training on span segmentation in English prose. / Clear, coherent prose with identifiable sentence structure suitable for training a span-aware model in the context of natural language processing. / Clear sentence structure with identifiable spans; useful for learning span composition in English prose. / The text segment is coherent, well-formed and contains clear linguistic structures that can be segmented into meaningful spans for training purposes in a tokenizer-free span-aware model focused on natural language processing tasks. / Clear sentence structure with identifiable spans; useful for learning span segmentation in English prose."}}
{"raw": "*5. If Amherst does not Win its first game, then it is not the case that either Colgate or Dartmouth wins its first game. 6.", "type": "natural", "id": {"id": "fe6e604e-a34c-42e6-b305-e842d61197cb"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.74, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear logical structure with potential for learning complex sentence spans; clean and coherent text segment representative of advanced reasoning patterns in English language. / Clear logical structure with identifiable spans; useful for learning complex sentence patterns in NLP. / Clear logical structure with identifiable spans; useful for learning complex sentence patterns in NLP. / Clear logical structure with identifiable spans; useful for learning complex sentence patterns and negation handling in NLP tasks. / Clear logical structure with identifiable spans; useful for learning complex sentence composition in NLP tasks."}}
{"raw": "Another hint is to try to eliminate statements that occur in the premisses, but not in the conclusion. Such elimination can proceed only in aceordance with the Rules of Inference.", "type": "natural", "id": {"id": "ea456e61-9d39-4675-8ac0-640eb3b98d65"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.74, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear sentence structure with identifiable spans; useful for learning span segmentation in English prose. / Clear, coherent prose with identifiable logical structures suitable for learning span segmentation in a non-tokenized context. / Clear sentence structure with identifiable spans; useful for learning patterns in logical reasoning and argumentation within text. / Clear, coherent prose with identifiable logical structures suitable for learning span segmentation in arguments and reasoning. / Clear, coherent prose with identifiable logical structures suitable for learning span segmentation in a non-tokenized context."}}
{"raw": "Fy 3 Iy 2-6,C.P. 8. (x)Fx 3 Ix) 7, UG\nMore than one assumption of limited scope can be made in proving the validity of arguments involving quantifiers, as in the following Conditional Proof:\n1. (x)(Ax v Bx) 3 (Cx Dx)] 2. (x){ (Cx v Ex) 3 [(Fxv Gx) 3 Hx} /.. (xHAx 3 (Fx 3 Hx)] 3. (Ay v By) 3 (Cy Dy) 1, UI 4_ (Cy v Ey) 5 [(Fy v Gy) 3 Hy] 2, UI", "type": "mixed", "id": {"id": "08c03482-4874-4df2-9d13-660dbd367a1e"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "The segment contains a mix of symbols and notations that are neither coherent nor representative enough to form meaningful spans for training purposes; lacks clarity in structure. / Contains both structured logical expressions and programming-like notation, but lacks clear segmentation into meaningful spans for training purposes. The mixture of symbols without context makes it difficult to discern patterns or structures that can be learned by a span-aware model. Additionally, the presence of variables (x,y,z) suggests an abstract representation rather than concrete examples suitable for learning specific tokenization strategies in natural language processing tasks. / The segment lacks clear sentence structure and contains fragmented, ungrammatical expressions that do not form coherent statements or meaningful spans for training purposes. It appears to be a mix of symbols rather than structured programming logic or natural language text. / The segment contains a mixture of symbols and partial words that are not clearly structured for meaningful span segmentation; it lacks coherence as training data. / The segment contains a mix of mathematical notation and logical expressions, but lacks clear structure for meaningful span segmentation; it is not coherent as training data."}}
{"raw": "In addition to parentheses and the propositional symbols P Q, R, $ and s0 on, We could have selected as primitive operators any of the following pairs of symbols: and and 3 and and 3', or V and 9',instead of ~ and It is instruetive t0 inquire whether Or not any of those alternative choices of primitives would have made the resulting system funetionally complete (on the normal interpretation of the symhols 5' , which We shall denote by V 3') Before addressing ourselves to these problems, it will be well to", "type": "natural", "id": {"id": "22236ac7-7d2d-4fc4-a013-20f799d60a09"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "The text segment contains clear linguistic structures and can be segmented into meaningful spans such as phrases, sentences or clauses that are representative of complex sentence construction in English prose; however, it lacks explicit programming code constructs which makes the content purely 'natural'. / Clear sentence structure with identifiable spans; useful for learning span segmentation in English prose. / The segment contains clear, structured sentences with identifiable phrases and terms that can be segmented into meaningful spans for training purposes; it is coherent but lacks technical context or domain-specific patterns which may limit its utility in specialized tasks. / The text segment contains clear sentence structures and phrases that can be segmented into meaningful spans, such as \"parentheses,\" \"propositional symbols P Q R,\" etc., which are useful for learning span composition in a tokenizer-free context. / The segment contains clear, structured sentences with identifiable phrases and propositions that can be segmented into meaningful spans for training purposes; it is coherent but lacks technical depth or domain-specific patterns necessary to fully represent the target content type (natural language)."}}
{"raw": "assigns a T to S, then F Q; 3 $ We shall prove this by establishing a slightly more general result; which includes also the case in which the truth value assignment assigns an F to S instead. This is stated and established as our next meta - theorem. M E TA T H E 0 R E M IX , Let Q; represent any possible assignment of truth values to the n propositional symbols Pi, Pz, P;; and let $ be any wff which has no propositional components Other than P; (1 < i < n) If the truth value assignment represented by Q;", "type": "mixed", "id": {"id": "2667c90d-d0f5-42e4-8e19-7b180895fbf1"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "The segment contains a mix of formal language and logical expressions, with clear structure for learning span segmentation in both mathematical notation (like \"assigns\", \"T to S\") and propositional logic (\"Q;\", \"$ We shall prove this by establishing...\"). Despite some ambiguity around the exact nature of $ as it could be interpreted differently depending on context. / The segment contains a mix of formal language and logical expressions, with clear structured elements like assignments (T to S) that can be segmented into meaningful spans for learning purposes. Despite some punctuation issues (\"3 $ We shall prove this by establishing\"), it retains compositional value as an example combining natural text explanation within the context of propositional logic statements which are code-like constructs in nature. / The segment contains a mixture of formal logical notation and English prose, with clear structure for span segmentation (e.g., \"assigns\", \"truth value assignment\"). It is coherent but somewhat complex due to the presence of both natural language explanations and symbolic logic expressions which are valuable patterns in learning. / The segment contains a mix of formal language and logical expressions, which can be segmented into meaningful spans such as \"assigns\", \"truth value assignment\", etc., representing valuable patterns for learning span composition in both natural text (logical statements) and code-like structures (formal notation). / The segment contains a mixture of formal logic notation and English prose, with clear logical expressions that can be segmented into meaningful spans for training purposes; however, it lacks clarity in its current form due to the mix of symbols and text without proper context or explanation."}}
{"raw": "$ (simple) Theory of Logical Types, which can be given the following rough formulation. A ccording to Russell entities are divided into & hierarchy of different logical types; the lowest of which consists of all individuals.", "type": "mixed", "id": {"id": "806d0d68-d742-4dd9-b7a0-320acce11824"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "The segment contains a mix of programming syntax and philosophical text, with clear delimiters for potential span segmentation (e.g., dollar signs indicating variables or commands). Despite some informal language (\"simple\"), it maintains compositional value in representing logical types hierarchy which can be useful to learn. / Contains a mix of programming syntax and text, which may confuse the model's understanding; lacks clear span segmentation patterns. / Contains both programming-like syntax and philosophical text, offering diverse span patterns for learning. / Contains both programming syntax and philosophical text, demonstrating a mix of structured elements useful for learning span segmentation in diverse contexts. / Contains both programming syntax and philosophical text, with clear logical structure for span segmentation."}}
{"raw": "Fy = V\nProof: We begin  with the instance of P 6 in which Fz' is ~(~ = y) ; (y)[~(y = y) = (Jx)(x = y) ~(x = y)]] P 6 ~(y = y) = (Jx)(x = y) - (x = y)]", "type": "code", "id": {"id": "58eb38b5-d508-4d9d-b88b-f31b4856d0f5"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.72, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "The segment contains a mixture of symbolic expressions and logical notation, which can be segmented into meaningful spans for learning purposes; however, it lacks clarity due to the presence of symbols that may not directly correspond with natural language syntax or programming constructs. / Clear mathematical expressions and logical statements, suitable for learning span segmentation in programming contexts. / Clear structured elements with mathematical expressions and logical operators suitable for span segmentation in programming context. Well-defined patterns present, though some symbols may need clarification or standardization for broader training utility. / Clear logical expressions and mathematical notation, representing valuable patterns for learning span composition in programming contexts. / The segment contains clear mathematical expressions and logical notations that can be segmented into meaningful spans for a span-aware model to learn from, representing valuable patterns in programming logic."}}
{"raw": "quadruples of F' $, and finally, we shall fill in the top half of the extreme left-hand initial column with Ts and its bottom half with Fs.", "type": "natural", "id": {"id": "801332c7-2b71-493a-b5be-519dd8011c5b"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.74, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear structure; spans can be identified as 'quadruples', '$' symbol, and column descriptions ('top half of the extreme left-hand initial column with Ts'). Well-formed for training purposes in a tokenizer-free context. / Clear structure of a mathematical or logical explanation with identifiable spans such as \"quadruples,\" \"$$\", and variable names like 'F' which can be segmented for learning purposes. The text is clean, coherent, representing valuable patterns in span composition within the context of mathematics or programming logic. / Clear structure, meaningful spans identified; clean and coherent text segment representative of instructional language. / Clear sentence structure, but lacks context for meaningful span segmentation in a training scenario. Could be improved with additional examples or domain-specific content. / The text segment contains clear instructions for filling a grid with characters, which can be segmented into meaningful spans such as \"quadruples of F' \", \"$\", and the actions to fill in columns; it is clean but lacks context or domain-specific patterns that could enhance training utility."}}
{"raw": "Hence Ax: 2 is independent.", "type": "natural", "id": {"id": "cca97ac1-6b64-4a42-bcf8-19ceb7ff0ec7"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.8, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear sentence structure with a logical conclusion; spans can be identified as \"Ax\", \": \", and \"is independent.\" These elements represent meaningful linguistic patterns for training purposes in the context of span segmentation within English text. / Clear independence statement with a mix of symbols and text, representing both mathematical notation (code-like) and explanatory language (natural). Suitable for learning span segmentation in diverse contexts. / Clear sentence structure with a meaningful span (subject and predicate). Suitable for learning simple grammatical patterns in English text. / Clear sentence structure with a meaningful span (\"Ax: 2 is independent.\") that can be used to learn context and composition in text. / Clear sentence structure with a meaningful span (\"Ax: 2 is independent.\") that can be used to train the model on recognizing and segmenting spans in English text."}}
{"raw": "Hence the argument is invalid only if the statement F is both true and false, which is impossible.", "type": "natural", "id": {"id": "b60a8c33-2cca-4dd1-a88f-4701c34d12c3"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.78, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear argument structure with identifiable spans; useful for learning logical reasoning and negation in text. / The segment contains a clear logical argument with identifiable spans (\"the argument\", \"is invalid only if the statement F is both true and false\"). It's coherent, clean for training purposes, representing valuable patterns in reasoning within language context. / The text segment contains a clear argument structure with identifiable spans such as \"the argument,\" \"invalid only if the statement F is both true and false,\" which are meaningful for learning span composition in logical statements within English prose. / Clear argument structure with identifiable spans; useful for learning logical reasoning patterns in text. / Clear argument structure with identifiable spans; well-suited for learning logical reasoning patterns in text."}}
{"raw": "equivalence is different when Q occurs as conse- quent, rather than antececlent; Although the universal quantification of F 3 Q' implies `(x)F 3 Q , it is not implied by the latter. There is an", "type": "natural", "id": {"id": "62c116df-900a-44e2-8958-4e04e69fb3ab"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "The text segment contains clear logical structures and mathematical expressions that can be segmented into meaningful spans for learning purposes, despite being somewhat fragmented due to the abrupt ending. It is clean but lacks coherence as a standalone example; however, it represents valuable patterns in formal logic or mathematics which are beneficial for span-aware models like X-Spanformer. / Clear sentence structure with identifiable spans; useful for learning span segmentation in English text. / Clear sentence structure with identifiable spans; represents complex linguistic patterns useful for learning span segmentation in English text. / Clear sentence structure with identifiable phrases; useful for learning span segmentation in English prose. / Clear sentence structure with logical progression; spans can be identified as individual phrases or clauses, representing valuable patterns for learning span composition in a language context."}}
{"raw": "It must be emphasized that although a valid argument form has only valid arguments as substitution instances, an invalid argument form can have both", "type": "natural", "id": {"id": "ecda0ba3-027e-43d4-9491-49bbd59f875d"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear sentence structure with a complex argument form; spans can be identified for training purposes. / The text segment contains a clear argument structure with identifiable spans, such as \"valid argument form,\" which can be useful for learning span segmentation in the context of logical expressions or arguments within English prose. It is clean and coherent but lacks explicit code elements to classify it strictly under 'code'. / Clear sentence structure with a potential for identifying argumentation patterns in text, suitable as training data for understanding span segmentation within arguments and logical structures. / Clear sentence structure; spans can be identified as individual phrases or clauses, representing valuable patterns for learning span composition in a purely linguistic context. / The text segment contains a clear argument structure with identifiable spans (\"valid argument form\", \"invalid argument form\") that can be used to train the model on recognizing and understanding logical structures in English prose, which is valuable for span segmentation tasks focused solely on language content without code."}}
{"raw": "394 Index\nProof (cont.) universal, 65, 85-86 of incompleteness of rules, 333-336 words, 126 of independence of axioms, 165, 231-237, Quantifier 262-266 existential, 65 indirect, 52-54, 55, 59-60, 61-62, 250 initially placed, 311 of invalidity, 20, 24-25, 48-49, 78-81, negation, 109-110", "type": "code", "id": {"id": "c0e0e9d7-d3f6-46b2-9429-6cb4bed35a95"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.8, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear structure with identifiable spans like \"Quantifier\", \"existential quantifier\" indicating meaningful patterns for learning span segmentation in programming contexts. / Clear structure with identifiable spans like \"Index\", \"Proof (cont.) universal, 65, 85-86 of incompleteness of rules,\" etc., representing valuable patterns for learning span composition in programming documentation or configuration files. / Clear structured elements like \"Index\", function names, and terms related to programming concepts are present; well-suited for learning span segmentation in a coding context. / Clear structure with identifiable spans like \"Index,\" \"Proof (cont.),\" and programming constructs (\"Quantifier\"). Well-formed for training purposes, representing valuable patterns in span composition within a coding context. / Clear structure with identifiable spans like \"Index\", \"Proof (cont.) universal, 65, 85-86 of incompleteness of rules,\" etc., representing valuable patterns for learning span composition in programming documentation or configuration files."}}
{"raw": "3 P Axiom 2. P 3 (Pv Q) Axiom 3. [Pv (Q v R)] 5 [Q v (Pv R)]", "type": "code", "id": {"id": "bd49854b-1869-4989-9243-15fb563fa71e"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.78, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear logical structure and pattern of axioms, suitable for learning span composition in programming constructs. / Clear logical structure representing programming constructs; spans can be identified as individual axioms and expressions, which are valuable for learning span composition in a coding context. / Clear logical structure with identifiable patterns for span segmentation; well-suited to learning from programming constructs. / Clear logical structure representing axioms and implications, suitable for learning span segmentation in programming constructs. / Clear logical structure with identifiable spans; useful for learning patterns in formal expressions and symbolic logic."}}
{"raw": "3. Use the reductio ad absurdlum method of assigning truth values to classify the statement forms in Exercise I on pages 30-31 as tautologous, contradietory, or con- tingent.", "type": "natural", "id": {"id": "69876ed2-0afc-48f7-95aa-f2e162272b60"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.74, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear sentence structure with identifiable spans; represents logical reasoning patterns in text. / Clear sentence structure with identifiable spans; useful for learning span segmentation in English prose. / Clear sentence structure with identifiable spans; useful for learning span segmentation in English prose. / Clear sentence structure with identifiable spans; useful for learning context and logical expressions in English text. / Clear sentence structure with identifiable spans (subject, verb phrase), though somewhat formal and academic in nature which may limit diversity of training data."}}
{"raw": "The Separation Axiom will not help us here.", "type": "natural", "id": {"id": "95c046fd-7701-4bdd-90e2-fb437222cd17"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.8, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear sentence structure with a single meaningful span; represents clean, coherent language suitable for training. / Clear, coherent sentence with a single meaningful span; represents clean and well-formed language suitable for training purposes. / Clear, coherent sentence with a single meaningful span; suitable for learning simple text spans in English. / Clear, coherent sentence with a single meaningful span; represents simple syntactic structure in English text. / Clear, coherent sentence with a single meaningful span; suitable for learning context and negation patterns in NLP tasks."}}
{"raw": "4 Quantification Theory 4.1 Singular Propositions and General Propositions The logical techniques developed thus far apply only to arguments whose validity depends upon the way in which simple statements are truth-function- ally combined into compound statements. Those techniques cannot be applied to such arguments as the following: All humans are mortal. Soerates is human. Therefore, Socrates is mortal The validity of such an argument depends upon the inner logieal structure of the noncompound statements", "type": "natural", "id": {"id": "f747467f-c7fd-4cad-b637-cf72521b0976"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear, coherent prose with identifiable logical structures and propositions suitable for learning span segmentation in a non-tokenizer context. / Clear logical structure with identifiable spans; well-suited for learning span composition in arguments and propositions. / Clear logical structure with identifiable spans; useful for learning argument composition and validity in natural language text. / Clear logical structure with identifiable spans; useful for learning argument composition and validity in logic. / Clear logical structure with identifiable propositions; useful for learning span segmentation in arguments."}}
{"raw": "it contains To appraise such arguments, we must develop methods for analyzing noncompound statements and symbolizing their inner structures: The second premiss of the preceding argument is a singular proposition; it says that the individual Socrates has the attribute of being human We call Socrates the subject term and human\" the predicate term.", "type": "natural", "id": {"id": "e4ac485e-4719-40f6-8b75-9f2c60c4b93d"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear structure with identifiable spans (subject, predicate); coherent and representative of argument analysis in text. / Clear sentence structure with identifiable subject-predicate pairs, useful for learning span segmentation in contextually rich text. / Clear sentence structure and identifiable subject-predicate pairs for span segmentation, though somewhat complex due to philosophical context. / The text contains clear linguistic structures with identifiable subjects, predicates and propositions suitable for learning span segmentation in a tokenizer-free context. However, it lacks explicit coding constructs or domain-specific patterns that are typically found within code segments; thus it's classified as 'natural'. / Clear sentence structure with identifiable subjects, predicates; useful for learning span segmentation in complex sentences."}}
{"raw": "The point is that we are here talking about well formed formulas of R.S. Both S1 and Axiom 3 denote infinitely many wffs of R.S,,and every wff of R.S. which is denoted by $, is also dlenoted by Axiom 3 (though not conversely). We can put the matter another way Our first derived rule (DR 1) validates infinitely many arguments formu- lable within RS,, for example:\n((A) (~(B)))", "type": "mixed", "id": {"id": "10ebf0fe-10c3-4701-94b7-4354d3d7bc4e"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "The segment contains a mix of formal language and logical expressions, with clear structure for learning span segmentation in both mathematical notation (e.g., \"wffs\", \"$\") and programming-like constructs (\"DR1\"). It is coherent but lacks context to fully understand the domain-specific patterns. / The segment contains a mix of formal language and mathematical notation, which can be segmented into meaningful spans like \"well formed formulas,\" \"axiom 3,\" etc., representing valuable patterns for learning span composition in both natural language processing (NLP) tasks related to mathematics or computer science. / Contains a mix of formal language and mathematical notation, with clear spans for both logical expressions (natural) and axioms/rules (code). Well-formed but complex structure may challenge the model's learning capability in span segmentation. / The segment contains a mixture of formal logical notation and English prose, with clear structure for span segmentation; however, it lacks clarity in some parts due to informal language (\"put the matter another way\"). It is coherent but may require additional context or examples from both domains. / Contains a mix of mathematical notation and English prose, with clear structure for span segmentation; however, it lacks coherence due to the mixture of languages/formats."}}
{"raw": "In 1938 Godel proved that if the other axioms of set theory are consistent, then the result of adding the Choice Axiom to them is also consist- ent.45 In 1963 Paul J. Cohen proved that the Choice Axiom cannot be derived from the other axioms.46 Exponentiation of cardinal numbers follows the same pattern. In the finite case, just as multiplication involves the addition of equal summands, SO exponentiation involves the multiplication of equal faetors. We recall that for finite nonzero cardinal numbers a, b,", "type": "natural", "id": {"id": "13ce333f-8726-458a-addd-225ccb407118"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.72, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear and coherent prose with identifiable meaningful spans (e.g., names, dates). Well-suited for learning span segmentation in historical context sentences without complex structures or domain-specific jargon. / Clear structure with meaningful spans; contains historical statements and logical patterns relevant for learning span composition in the context of mathematical concepts, though it lacks direct coding constructs. / The segment contains both mathematical notation and prose, offering diverse patterns for span segmentation; however, it lacks clarity in separating distinct spans due to the mixture of content types. Further refinement could improve its utility as training data. / Clear structure with meaningful spans (e.g., \"1938 Godel\", \"Choice Axiom\"). Well-written and coherent, representing valuable patterns for learning span composition in the context of historical mathematical statements. / Clear structure with meaningful spans (e.g., \"1938 Godel\", \"Choice Axiom\"). Well-formatted and coherent for training purposes, representing valuable patterns in mathematical discourse within the realm of set theory."}}
{"raw": "Now that We have an effective criterion for wff ; we shall restrict our dliscussion in the remainder of this chapter to wffs which alone interest US. It is convenient at this point to introduce and define some additional special terms. (There is no loss of generalitv in phrasing our definitions in terms of undefined symbols only, for defined svmbols are always eliminable:) Df. If x is an individual variahle, then (x), when not immediately preceded by a predicate symhol, is the unicersal quantifier of 1 (or", "type": "natural", "id": {"id": "8c73bac2-c697-4389-a4c2-f172dd050d44"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear structure with definable terms and logical expressions; useful for learning span segmentation in formal language contexts. / Clear structure with definable terms and logical expressions suitable for learning span segmentation in the context of formal logic discussions. / The segment contains clear structured elements like definitions and logical expressions that can be segmented into meaningful spans for learning purposes, despite some typographical errors (\"dliscussion\" should likely read \"discussion\", etc.). It is coherent in its context of discussing formal logic or mathematics. / Clear structure with identifiable spans; well-defined terms and logical expressions suitable for learning span composition in NLP context. / Clear sentence structure with identifiable phrases and terms; useful for learning span segmentation in English text."}}
{"raw": "the same equalities obtain as for finite cardinals. So We have X8 = 1, and for any finite cardinal a 0,\nXs = So Xo'No\" . Xo = So:\nIf the set B in B' is equal to 2 ( = {0,1}), we have the set of all characteristic functions of subsets of A.", "type": "mixed", "id": {"id": "945c4813-6b6d-467d-9eb5-b4e8a9db55d7"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Contains both mathematical notation and prose, with clear structure for span segmentation; represents valuable patterns in a mix of domains. / Contains a mix of mathematical notation and prose, with clear structure for span segmentation; however, it lacks clarity in some expressions which may hinder learning patterns effectively. / The segment contains a mixture of mathematical notation and prose, with clear structures like equations (X8 = 1) that can be segmented into meaningful spans for learning span composition in both natural language contexts (\"So We have X8\") and code constructs (\"Xs = So\"). / Contains a mix of mathematical notation and prose, with clear spans for both equations (e.g., X8 = 1) and explanatory text that can help the model learn span segmentation in scientific contexts. / The segment contains a mix of mathematical notation and prose, with clear spans for both equations (X8 = 1) and textual explanations that can be useful in learning span segmentation across different content types."}}
{"raw": "The definition is this: For any subset A' CA the characteristic function Fa\": A _ 2 is such that (x)x  A' 5 fa (x) = 1) and (x)x  (A ~ A') 3 fa (1) = 0 It is useful to think of the charaeteristic function fA' , for each A' C A as a condition members of A such that every member 1\" of A for which on fa (x) = 1 satisfes the condition; and such that every member xof A for which fa (x) = 0 does not satisfy the condition: The Separation Axiom states that any such condition f4' (x) on members of A dletermines &", "type": "mixed", "id": {"id": "daefecba-6361-4d0b-8489-731b1135dc53"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "The segment contains a mix of mathematical notation and prose, with clear logical structures that can be segmented into meaningful spans for learning span composition in both domains. However, the presence of symbols like \"A\", \"f_a(x)\", etc., without context makes it less ideal as is; additional preprocessing might improve its utility. / The segment contains a mix of mathematical notation and prose, with clear delineations between definitions (spans) that can be useful for learning span segmentation in both domains. However, the presence of symbols like \"A\", \"f_a\" may confuse models not trained on such content types together. / The segment contains a mixture of mathematical notation and prose, with clear boundaries for spans such as \"characteristic function\", \"A'\", \"(x)x  A' \", etc., which are useful patterns to learn span segmentation in both natural language context and code-like expressions. / The text contains a mix of mathematical notation and prose, with clear delineation between definitions (natural language) and formal expressions ((x)x  A' 5 fa(x) = 1). It presents valuable patterns for learning span segmentation in both natural language descriptions and code-like structures. / The segment contains a mix of formal definitions and mathematical notation, which can help the model learn span segmentation for both structured expressions (like equations) and descriptive text in academic contexts. However, it may require additional context or examples to improve clarity further."}}
