{"raw": "Thus additional substitution instances of the propositional function F V (Cy: Hx)\" are Fa v (Ga: Ha) , Fh V (Gh: Ih)'", "type": "mixed", "id": {"id": "42e9d38e-b92a-431d-bd34-92cf9a569c7e"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.74, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "The segment contains a mix of mathematical notation and logical expressions, with clear structured elements that can be segmented into meaningful spans for learning span composition in both domains. / The segment contains a mix of symbolic expressions and logical notation, which can be segmented into meaningful spans for learning span composition in both mathematical logic contexts (code-like) and formal language structures (natural). It is clean but may require domain-specific knowledge to fully understand the context. / Clear structured patterns with logical expressions and nested functions, suitable for learning span segmentation in programming contexts. / Contains a mix of symbolic expressions and logical notation, which can be segmented into meaningful spans for learning complex span compositions in both mathematical logic contexts (code) and formal language structures (natural). / Clear syntactic structure with identifiable spans; represents valuable patterns for learning span composition in programming contexts."}}
{"raw": "be contingent or contingencies. For example, P, ~P P V G, p* 4, and p 3 q are contingent statement forms; and B, C, ~B, ~C, B-C, Bv C are contingent statements The term is appropriate, since their truth values are not formally determined but are dependent or contingent upon what happens to be the case. It is easily proved that p 3 (q 5 p) and ~p 3 (p 3 q) are tautologies.", "type": "natural", "id": {"id": "3c40bffc-cf4b-4f1e-a052-b6f976d160fc"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear sentence structure with identifiable spans; useful for learning context and logical expressions in English text. / The text segment contains clear logical structures and relationships between statements, which can be segmented into meaningful spans for learning span composition in a tokenizer-free context. It is coherent but lacks explicit coding constructs or domain-specific jargon that could enhance its utility as mixed-type training data. / The text segment contains clear logical structures and expressions that can be segmented into meaningful spans, such as \"p V G\", \"~P P\", etc., which are representative of propositional logic patterns in formal reasoning contexts. It is clean for training purposes but lacks domain-specific jargon or context clues to improve its utility further. / Clear sentences with logical structures; useful for learning span segmentation in complex statements. / The text segment contains clear logical structures and statements that can be segmented into meaningful spans, representing valuable patterns for learning span composition in the context of formal logic or philosophical arguments within natural language. It is clean but lacks explicit code constructs to classify as \"code\"."}}
{"raw": "that there is some one thing such that everything attracts it. Where two quantifiers are applied successively to one propositional function, if they are both universal or both existential, their order does not matter, as is shown by the equivalence of formulas 1 and 2,3 and 4, and 5 and 6. But where one is universal and the other existential, the order of general- ization 0r quantification is very important.", "type": "natural", "id": {"id": "c1f0ae5b-98f0-4679-896e-8b2f62e872a5"}, "meta": {"status": "keep", "tags": [], "doc_language": "en", "extracted_by": "pdf2seg", "confidence": 0.7, "source_file": "zlib.pub_symbolic-logic.pdf", "notes": "Clear prose with identifiable patterns of quantifiers and propositional functions, suitable for learning span segmentation in a tokenizer-free context. / Clear sentence structure with identifiable spans; useful for learning complex linguistic patterns. / Clear prose with identifiable meaningful spans; well-formed for training purposes, though somewhat abstract in nature. / Clear structure with identifiable spans; useful for learning complex sentence patterns and logical constructs in text. / Clear prose with identifiable logical structures and quantifier patterns useful for learning span segmentation in a tokenizer-free context."}}
